sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.h
/*!
    \file    gd32a7xx_dma.h
    \brief   definitions for the DMA

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_DMA_H
#define GD32A7XX_DMA_H

#include "gd32a7xx.h"

/* DMA definitions */
#define DMA0                              (DMA_BASE)                      /*!< DMA0 base address */
#define DMA1                              (DMA_BASE + 0x0400U)            /*!< DMA1 base address */

/* DMAMUX definitions */
#define DMAMUX                             DMAMUX_BASE                    /*!< DMA base address */

/* registers definitions */
/* DMA registers definitions */
#define DMA_INTF0(dmax)                    REG32((dmax) + 0x00U)          /*!< DMA interrupt flag register 0 */
#define DMA_INTF1(dmax)                    REG32((dmax) + 0x04U)          /*!< DMA interrupt flag register 1 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMA_INTF2(dmax)                    REG32((dmax) + 0x08U)          /*!< DMA interrupt flag register 2 */
#define DMA_INTF3(dmax)                    REG32((dmax) + 0x0CU)          /*!< DMA interrupt flag register 3 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define DMA_INTC0(dmax)                    REG32((dmax) + 0x10U)          /*!< DMA interrupt flag clear register 0 */
#define DMA_INTC1(dmax)                    REG32((dmax) + 0x14U)          /*!< DMA interrupt flag clear register 1 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMA_INTC2(dmax)                    REG32((dmax) + 0x18U)          /*!< DMA interrupt flag clear register 2 */
#define DMA_INTC3(dmax)                    REG32((dmax) + 0x1CU)          /*!< DMA interrupt flag clear register 3 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define DMA_CH0CTL(dmax)                   REG32((dmax) + 0x20U)          /*!< DMA channel 0 control register */
#define DMA_CH0CNT(dmax)                   REG32((dmax) + 0x24U)          /*!< DMA channel 0 counter register */
#define DMA_CH0PADDR(dmax)                 REG32((dmax) + 0x28U)          /*!< DMA channel 0 peripheral base address register */
#define DMA_CH0M0ADDR(dmax)                REG32((dmax) + 0x2CU)          /*!< DMA channel 0 memory 0 base address register */
#define DMA_CH0M1ADDR(dmax)                REG32((dmax) + 0x30U)          /*!< DMA channel 0 memory 1 base address register */
#define DMA_CH0FCTL(dmax)                  REG32((dmax) + 0x34U)          /*!< DMA channel 0 FIFO control register */
#define DMA_CH0PCRCDATA(dmax)              REG32((dmax) + 0x200U)         /*!< DMA channel 0 peripheral CRC data register */
#define DMA_CH0TOCTL(dmax)                 REG32((dmax) + 0x300U)         /*!< DMA channel 0 transfer timeout monitor control register */
#define DMA_CH0PCADDR(dmax)                REG32((dmax) + 0x350U)         /*!< DMA channel 0 peripheral port current address register */
#define DMA_CH0MCADDR(dmax)                REG32((dmax) + 0x390U)         /*!< DMA channel 0 memory port current address register */
#define DMA_CH1CTL(dmax)                   REG32((dmax) + 0x38U)          /*!< DMA channel 1 control register */
#define DMA_CH1CNT(dmax)                   REG32((dmax) + 0x3CU)          /*!< DMA channel 1 counter register */
#define DMA_CH1PADDR(dmax)                 REG32((dmax) + 0x40U)          /*!< DMA channel 1 peripheral base address register */
#define DMA_CH1M0ADDR(dmax)                REG32((dmax) + 0x44U)          /*!< DMA channel 1 memory 0 base address register */
#define DMA_CH1M1ADDR(dmax)                REG32((dmax) + 0x48U)          /*!< DMA channel 1 memory 1 base address register */
#define DMA_CH1FCTL(dmax)                  REG32((dmax) + 0x4CU)          /*!< DMA channel 1 FIFO control register */
#define DMA_CH1PCRCDATA(dmax)              REG32((dmax) + 0x204U)         /*!< DMA channel 1 peripheral CRC data register */
#define DMA_CH1TOCTL(dmax)                 REG32((dmax) + 0x304U)         /*!< DMA channel 1 transfer timeout monitor control register */
#define DMA_CH1PCADDR(dmax)                REG32((dmax) + 0x354U)         /*!< DMA channel 1 peripheral port current address register */
#define DMA_CH1MCADDR(dmax)                REG32((dmax) + 0x394U)         /*!< DMA channel 1 memory port current address register */
#define DMA_CH2CTL(dmax)                   REG32((dmax) + 0x50U)          /*!< DMA channel 2 control register */
#define DMA_CH2CNT(dmax)                   REG32((dmax) + 0x54U)          /*!< DMA channel 2 counter register */
#define DMA_CH2PADDR(dmax)                 REG32((dmax) + 0x58U)          /*!< DMA channel 2 peripheral base address register */
#define DMA_CH2M0ADDR(dmax)                REG32((dmax) + 0x5CU)          /*!< DMA channel 2 memory 0 base address register */
#define DMA_CH2M1ADDR(dmax)                REG32((dmax) + 0x60U)          /*!< DMA channel 2 memory 1 base address register */
#define DMA_CH2FCTL(dmax)                  REG32((dmax) + 0x64U)          /*!< DMA channel 2 FIFO control register */
#define DMA_CH2PCRCDATA(dmax)              REG32((dmax) + 0x208U)         /*!< DMA channel 2 peripheral CRC data register */
#define DMA_CH2TOCTL(dmax)                 REG32((dmax) + 0x308U)         /*!< DMA channel 2 transfer timeout monitor control register */
#define DMA_CH2PCADDR(dmax)                REG32((dmax) + 0x358U)         /*!< DMA channel 2 peripheral port current address register */
#define DMA_CH2MCADDR(dmax)                REG32((dmax) + 0x398U)         /*!< DMA channel 2 memory port current address register */
#define DMA_CH3CTL(dmax)                   REG32((dmax) + 0x68U)          /*!< DMA channel 3 control register */
#define DMA_CH3CNT(dmax)                   REG32((dmax) + 0x6CU)          /*!< DMA channel 3 counter register */
#define DMA_CH3PADDR(dmax)                 REG32((dmax) + 0x70U)          /*!< DMA channel 3 peripheral base address register */
#define DMA_CH3M0ADDR(dmax)                REG32((dmax) + 0x74U)          /*!< DMA channel 3 memory 0 base address register */
#define DMA_CH3M1ADDR(dmax)                REG32((dmax) + 0x78U)          /*!< DMA channel 3 memory 1 base address register */
#define DMA_CH3FCTL(dmax)                  REG32((dmax) + 0x7CU)          /*!< DMA channel 3 FIFO control register */
#define DMA_CH3PCRCDATA(dmax)              REG32((dmax) + 0x20CU)         /*!< DMA channel 3 peripheral CRC data register */
#define DMA_CH3TOCTL(dmax)                 REG32((dmax) + 0x30CU)         /*!< DMA channel 3 transfer timeout monitor control register */
#define DMA_CH3PCADDR(dmax)                REG32((dmax) + 0x35CU)         /*!< DMA channel 3 peripheral port current address register */
#define DMA_CH3MCADDR(dmax)                REG32((dmax) + 0x39CU)         /*!< DMA channel 3 memory port current address register */
#define DMA_CH4CTL(dmax)                   REG32((dmax) + 0x80U)          /*!< DMA channel 4 control register */
#define DMA_CH4CNT(dmax)                   REG32((dmax) + 0x84U)          /*!< DMA channel 4 counter register */
#define DMA_CH4PADDR(dmax)                 REG32((dmax) + 0x88U)          /*!< DMA channel 4 peripheral base address register */
#define DMA_CH4M0ADDR(dmax)                REG32((dmax) + 0x8CU)          /*!< DMA channel 4 memory 0 base address register */
#define DMA_CH4M1ADDR(dmax)                REG32((dmax) + 0x90U)          /*!< DMA channel 4 memory 1 base address register */
#define DMA_CH4FCTL(dmax)                  REG32((dmax) + 0x94U)          /*!< DMA channel 4 FIFO control register */
#define DMA_CH4PCRCDATA(dmax)              REG32((dmax) + 0x210U)         /*!< DMA channel 4 peripheral CRC data register */
#define DMA_CH4TOCTL(dmax)                 REG32((dmax) + 0x310U)         /*!< DMA channel 4 transfer timeout monitor control register */
#define DMA_CH4PCADDR(dmax)                REG32((dmax) + 0x360U)         /*!< DMA channel 4 peripheral port current address register */
#define DMA_CH4MCADDR(dmax)                REG32((dmax) + 0x3A0U)         /*!< DMA channel 4 memory port current address register */
#define DMA_CH5CTL(dmax)                   REG32((dmax) + 0x98U)          /*!< DMA channel 5 control register */
#define DMA_CH5CNT(dmax)                   REG32((dmax) + 0x9CU)          /*!< DMA channel 5 counter register */
#define DMA_CH5PADDR(dmax)                 REG32((dmax) + 0xA0U)          /*!< DMA channel 5 peripheral base address register */
#define DMA_CH5M0ADDR(dmax)                REG32((dmax) + 0xA4U)          /*!< DMA channel 5 memory 0 base address register */
#define DMA_CH5M1ADDR(dmax)                REG32((dmax) + 0xA8U)          /*!< DMA channel 5 memory 1 base address register */
#define DMA_CH5FCTL(dmax)                  REG32((dmax) + 0xACU)          /*!< DMA channel 5 FIFO control register */
#define DMA_CH5PCRCDATA(dmax)              REG32((dmax) + 0x214U)         /*!< DMA channel 5 peripheral CRC data register */
#define DMA_CH5TOCTL(dmax)                 REG32((dmax) + 0x314U)         /*!< DMA channel 5 transfer timeout monitor control register */
#define DMA_CH5PCADDR(dmax)                REG32((dmax) + 0x364U)         /*!< DMA channel 5 peripheral port current address register */
#define DMA_CH5MCADDR(dmax)                REG32((dmax) + 0x3A4U)         /*!< DMA channel 5 memory port current address register */
#define DMA_CH6CTL(dmax)                   REG32((dmax) + 0xB0U)          /*!< DMA channel 6 control register */
#define DMA_CH6CNT(dmax)                   REG32((dmax) + 0xB4U)          /*!< DMA channel 6 counter register */
#define DMA_CH6PADDR(dmax)                 REG32((dmax) + 0xB8U)          /*!< DMA channel 6 peripheral base address register */
#define DMA_CH6M0ADDR(dmax)                REG32((dmax) + 0xBCU)          /*!< DMA channel 6 memory 0 base address register */
#define DMA_CH6M1ADDR(dmax)                REG32((dmax) + 0xC0U)          /*!< DMA channel 6 memory 1 base address register */
#define DMA_CH6FCTL(dmax)                  REG32((dmax) + 0xC4U)          /*!< DMA channel 6 FIFO control register */
#define DMA_CH6PCRCDATA(dmax)              REG32((dmax) + 0x218U)         /*!< DMA channel 6 peripheral CRC data register */
#define DMA_CH6TOCTL(dmax)                 REG32((dmax) + 0x318U)         /*!< DMA channel 6 transfer timeout monitor control register */
#define DMA_CH6PCADDR(dmax)                REG32((dmax) + 0x368U)         /*!< DMA channel 6 peripheral port current address register */
#define DMA_CH6MCADDR(dmax)                REG32((dmax) + 0x3A8U)         /*!< DMA channel 6 memory port current address register */
#define DMA_CH7CTL(dmax)                   REG32((dmax) + 0xC8U)          /*!< DMA channel 7 control register */
#define DMA_CH7CNT(dmax)                   REG32((dmax) + 0xCCU)          /*!< DMA channel 7 counter register */
#define DMA_CH7PADDR(dmax)                 REG32((dmax) + 0xD0U)          /*!< DMA channel 7 peripheral base address register */
#define DMA_CH7M0ADDR(dmax)                REG32((dmax) + 0xD4U)          /*!< DMA channel 7 memory 0 base address register */
#define DMA_CH7M1ADDR(dmax)                REG32((dmax) + 0xD8U)          /*!< DMA channel 7 memory 1 base address register */
#define DMA_CH7FCTL(dmax)                  REG32((dmax) + 0xDCU)          /*!< DMA channel 7 FIFO control register */
#define DMA_CH7PCRCDATA(dmax)              REG32((dmax) + 0x21CU)         /*!< DMA channel 7 peripheral CRC data register */
#define DMA_CH7TOCTL(dmax)                 REG32((dmax) + 0x31CU)         /*!< DMA channel 7 transfer timeout monitor control register */
#define DMA_CH7PCADDR(dmax)                REG32((dmax) + 0x36CU)         /*!< DMA channel 7 peripheral port current address register */
#define DMA_CH7MCADDR(dmax)                REG32((dmax) + 0x3ACU)         /*!< DMA channel 7 memory port current address register */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMA_CH8CTL(dmax)                   REG32((dmax) + 0xE0U)          /*!< DMA channel 8 control register */
#define DMA_CH8CNT(dmax)                   REG32((dmax) + 0xE4U)          /*!< DMA channel 8 counter register */
#define DMA_CH8PADDR(dmax)                 REG32((dmax) + 0xE8U)          /*!< DMA channel 8 peripheral base address register */
#define DMA_CH8M0ADDR(dmax)                REG32((dmax) + 0xECU)          /*!< DMA channel 8 memory 0 base address register */
#define DMA_CH8M1ADDR(dmax)                REG32((dmax) + 0xF0U)          /*!< DMA channel 8 memory 1 base address register */
#define DMA_CH8FCTL(dmax)                  REG32((dmax) + 0xF4U)          /*!< DMA channel 8 FIFO control register */
#define DMA_CH8PCRCDATA(dmax)              REG32((dmax) + 0x220U)         /*!< DMA channel 8 peripheral CRC data register */
#define DMA_CH8TOCTL(dmax)                 REG32((dmax) + 0x320U)         /*!< DMA channel 8 transfer timeout monitor control register */
#define DMA_CH8PCADDR(dmax)                REG32((dmax) + 0x370U)         /*!< DMA channel 8 peripheral port current address register */
#define DMA_CH8MCADDR(dmax)                REG32((dmax) + 0x3B0U)         /*!< DMA channel 8 memory port current address register */
#define DMA_CH9CTL(dmax)                   REG32((dmax) + 0xF8U)          /*!< DMA channel 9 control register */
#define DMA_CH9CNT(dmax)                   REG32((dmax) + 0xFCU)          /*!< DMA channel 9 counter register */
#define DMA_CH9PADDR(dmax)                 REG32((dmax) + 0x100U)         /*!< DMA channel 9 peripheral base address register */
#define DMA_CH9M0ADDR(dmax)                REG32((dmax) + 0x104U)         /*!< DMA channel 9 memory 0 base address register */
#define DMA_CH9M1ADDR(dmax)                REG32((dmax) + 0x108U)         /*!< DMA channel 9 memory 1 base address register */
#define DMA_CH9FCTL(dmax)                  REG32((dmax) + 0x10CU)         /*!< DMA channel 9 FIFO control register */
#define DMA_CH9PCRCDATA(dmax)              REG32((dmax) + 0x224U)         /*!< DMA channel 9 peripheral CRC data register */
#define DMA_CH9TOCTL(dmax)                 REG32((dmax) + 0x324U)         /*!< DMA channel 9 transfer timeout monitor control register */
#define DMA_CH9PCADDR(dmax)                REG32((dmax) + 0x374U)         /*!< DMA channel 9 peripheral port current address register */
#define DMA_CH9MCADDR(dmax)                REG32((dmax) + 0x3B4U)         /*!< DMA channel 9 memory port current address register */
#define DMA_CH10CTL(dmax)                  REG32((dmax) + 0x110U)         /*!< DMA channel 10 control register */
#define DMA_CH10CNT(dmax)                  REG32((dmax) + 0x114U)         /*!< DMA channel 10 counter register */
#define DMA_CH10PADDR(dmax)                REG32((dmax) + 0x118U)         /*!< DMA channel 10 peripheral base address register */
#define DMA_CH10M0ADDR(dmax)               REG32((dmax) + 0x11CU)         /*!< DMA channel 10 memory 0 base address register */
#define DMA_CH10M1ADDR(dmax)               REG32((dmax) + 0x120U)         /*!< DMA channel 10 memory 1 base address register */
#define DMA_CH10FCTL(dmax)                 REG32((dmax) + 0x124U)         /*!< DMA channel 10 FIFO control register */
#define DMA_CH10PCRCDATA(dmax)             REG32((dmax) + 0x228U)         /*!< DMA channel 10 peripheral CRC data register */
#define DMA_CH10TOCTL(dmax)                REG32((dmax) + 0x328U)         /*!< DMA channel 10 transfer timeout monitor control register */
#define DMA_CH10PCADDR(dmax)               REG32((dmax) + 0x378U)         /*!< DMA channel 10 peripheral port current address register */
#define DMA_CH10MCADDR(dmax)               REG32((dmax) + 0x3B8U)         /*!< DMA channel 10 memory port current address register */
#define DMA_CH11CTL(dmax)                  REG32((dmax) + 0x128U)         /*!< DMA channel 11 control register */
#define DMA_CH11CNT(dmax)                  REG32((dmax) + 0x12CU)         /*!< DMA channel 11 counter register */
#define DMA_CH11PADDR(dmax)                REG32((dmax) + 0x130U)         /*!< DMA channel 11 peripheral base address register */
#define DMA_CH11M0ADDR(dmax)               REG32((dmax) + 0x134U)         /*!< DMA channel 11 memory 0 base address register */
#define DMA_CH11M1ADDR(dmax)               REG32((dmax) + 0x138U)         /*!< DMA channel 11 memory 1 base address register */
#define DMA_CH11FCTL(dmax)                 REG32((dmax) + 0x13CU)         /*!< DMA channel 11 FIFO control register */
#define DMA_CH11PCRCDATA(dmax)             REG32((dmax) + 0x22CU)         /*!< DMA channel 11 peripheral CRC data register */
#define DMA_CH11TOCTL(dmax)                REG32((dmax) + 0x32CU)         /*!< DMA channel 11 transfer timeout monitor control register */
#define DMA_CH11PCADDR(dmax)               REG32((dmax) + 0x37CU)         /*!< DMA channel 11 peripheral port current address register */
#define DMA_CH11MCADDR(dmax)               REG32((dmax) + 0x3BCU)         /*!< DMA channel 11 memory port current address register */
#define DMA_CH12CTL(dmax)                  REG32((dmax) + 0x140U)         /*!< DMA channel 12 control register */
#define DMA_CH12CNT(dmax)                  REG32((dmax) + 0x144U)         /*!< DMA channel 12 counter register */
#define DMA_CH12PADDR(dmax)                REG32((dmax) + 0x148U)         /*!< DMA channel 12 peripheral base address register */
#define DMA_CH12M0ADDR(dmax)               REG32((dmax) + 0x14CU)         /*!< DMA channel 12 memory 0 base address register */
#define DMA_CH12M1ADDR(dmax)               REG32((dmax) + 0x150U)         /*!< DMA channel 12 memory 1 base address register */
#define DMA_CH12FCTL(dmax)                 REG32((dmax) + 0x154U)         /*!< DMA channel 12 FIFO control register */
#define DMA_CH12PCRCDATA(dmax)             REG32((dmax) + 0x230U)         /*!< DMA channel 12 peripheral CRC data register */
#define DMA_CH12TOCTL(dmax)                REG32((dmax) + 0x330U)         /*!< DMA channel 12 transfer timeout monitor control register */
#define DMA_CH12PCADDR(dmax)               REG32((dmax) + 0x380U)         /*!< DMA channel 12 peripheral port current address register */
#define DMA_CH12MCADDR(dmax)               REG32((dmax) + 0x3C0U)         /*!< DMA channel 12 memory port current address register */
#define DMA_CH13CTL(dmax)                  REG32((dmax) + 0x158U)         /*!< DMA channel 13 control register */
#define DMA_CH13CNT(dmax)                  REG32((dmax) + 0x15CU)         /*!< DMA channel 13 counter register */
#define DMA_CH13PADDR(dmax)                REG32((dmax) + 0x160U)         /*!< DMA channel 13 peripheral base address register */
#define DMA_CH13M0ADDR(dmax)               REG32((dmax) + 0x164U)         /*!< DMA channel 13 memory 0 base address register */
#define DMA_CH13M1ADDR(dmax)               REG32((dmax) + 0x168U)         /*!< DMA channel 13 memory 1 base address register */
#define DMA_CH13FCTL(dmax)                 REG32((dmax) + 0x16CU)         /*!< DMA channel 13 FIFO control register */
#define DMA_CH13PCRCDATA(dmax)             REG32((dmax) + 0x234U)         /*!< DMA channel 13 peripheral CRC data register */
#define DMA_CH13TOCTL(dmax)                REG32((dmax) + 0x334U)         /*!< DMA channel 13 transfer timeout monitor control register */
#define DMA_CH13PCADDR(dmax)               REG32((dmax) + 0x384U)         /*!< DMA channel 13 peripheral port current address register */
#define DMA_CH13MCADDR(dmax)               REG32((dmax) + 0x3C4U)         /*!< DMA channel 13 memory port current address register */
#define DMA_CH14CTL(dmax)                  REG32((dmax) + 0x170U)         /*!< DMA channel 14 control register */
#define DMA_CH14CNT(dmax)                  REG32((dmax) + 0x174U)         /*!< DMA channel 14 counter register */
#define DMA_CH14PADDR(dmax)                REG32((dmax) + 0x178U)         /*!< DMA channel 14 peripheral base address register */
#define DMA_CH14M0ADDR(dmax)               REG32((dmax) + 0x17CU)         /*!< DMA channel 14 memory 0 base address register */
#define DMA_CH14M1ADDR(dmax)               REG32((dmax) + 0x180U)         /*!< DMA channel 14 memory 1 base address register */
#define DMA_CH14FCTL(dmax)                 REG32((dmax) + 0x184U)         /*!< DMA channel 14 FIFO control register */
#define DMA_CH14PCRCDATA(dmax)             REG32((dmax) + 0x238U)         /*!< DMA channel 14 peripheral CRC data register */
#define DMA_CH14TOCTL(dmax)                REG32((dmax) + 0x338U)         /*!< DMA channel 14 transfer timeout monitor control register */
#define DMA_CH14PCADDR(dmax)               REG32((dmax) + 0x388U)         /*!< DMA channel 14 peripheral port current address register */
#define DMA_CH14MCADDR(dmax)               REG32((dmax) + 0x3C8U)         /*!< DMA channel 14 memory port current address register */
#define DMA_CH15CTL(dmax)                  REG32((dmax) + 0x188U)         /*!< DMA channel 15 control register */
#define DMA_CH15CNT(dmax)                  REG32((dmax) + 0x18CU)         /*!< DMA channel 15 counter register */
#define DMA_CH15PADDR(dmax)                REG32((dmax) + 0x190U)         /*!< DMA channel 15 peripheral base address register */
#define DMA_CH15M0ADDR(dmax)               REG32((dmax) + 0x194U)         /*!< DMA channel 15 memory 0 base address register */
#define DMA_CH15M1ADDR(dmax)               REG32((dmax) + 0x198U)         /*!< DMA channel 15 memory 1 base address register */
#define DMA_CH15FCTL(dmax)                 REG32((dmax) + 0x19CU)         /*!< DMA channel 15 FIFO control register */
#define DMA_CH15PCRCDATA(dmax)             REG32((dmax) + 0x23CU)         /*!< DMA channel 15 peripheral CRC data register */
#define DMA_CH15TOCTL(dmax)                REG32((dmax) + 0x33CU)         /*!< DMA channel 15 transfer timeout monitor control register */
#define DMA_CH15PCADDR(dmax)               REG32((dmax) + 0x38CU)         /*!< DMA channel 15 peripheral port current address register */
#define DMA_CH15MCADDR(dmax)               REG32((dmax) + 0x3CCU)         /*!< DMA channel 15 memory port current address register */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define DMA_CRCIDATA(dmax)                 REG32((dmax) + 0x240U)         /*!< DMA CRC initialization data register */
#define DMA_PCRCCTL(dmax)                  REG32((dmax) + 0x280U)         /*!< DMA peripheral CRC control register */
