sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.h
#define DMA_GCTL(dmax)                     REG32((dmax) + 0x2C0U)         /*!< DMA global control register */
#define DMA_TOINTF(dmax)                   REG32((dmax) + 0x340U)         /*!< DMA timeout flag register  */
#define DMA_TOINTEN(dmax)                  REG32((dmax) + 0x344U)         /*!< DMA timeout interrupt control register */
#define DMA_TFINTF(dmax)                   REG32((dmax) + 0x348U)         /*!< DMA TMR fault flag register   */
#define DMA_TFINTEN(dmax)                  REG32((dmax) + 0x34CU)         /*!< DMA TMR fault interrupt enable register */

/* DMAMUX registers definitions */
#define DMAMUX_RM_CH0CFG                   REG32(DMAMUX + 0x00U)          /*!< DMAMUX request multiplexer channel 0 configuration register */
#define DMAMUX_RM_CH1CFG                   REG32(DMAMUX + 0x04U)          /*!< DMAMUX request multiplexer channel 1 configuration register */
#define DMAMUX_RM_CH2CFG                   REG32(DMAMUX + 0x08U)          /*!< DMAMUX request multiplexer channel 2 configuration register */
#define DMAMUX_RM_CH3CFG                   REG32(DMAMUX + 0x0CU)          /*!< DMAMUX request multiplexer channel 3 configuration register */
#define DMAMUX_RM_CH4CFG                   REG32(DMAMUX + 0x10U)          /*!< DMAMUX request multiplexer channel 4 configuration register */
#define DMAMUX_RM_CH5CFG                   REG32(DMAMUX + 0x14U)          /*!< DMAMUX request multiplexer channel 5 configuration register */
#define DMAMUX_RM_CH6CFG                   REG32(DMAMUX + 0x18U)          /*!< DMAMUX request multiplexer channel 6 configuration register */
#define DMAMUX_RM_CH7CFG                   REG32(DMAMUX + 0x1CU)          /*!< DMAMUX request multiplexer channel 7 configuration register */
#define DMAMUX_RM_CH8CFG                   REG32(DMAMUX + 0x20U)          /*!< DMAMUX request multiplexer channel 8 configuration register */
#define DMAMUX_RM_CH9CFG                   REG32(DMAMUX + 0x24U)          /*!< DMAMUX request multiplexer channel 9 configuration register */
#define DMAMUX_RM_CH10CFG                  REG32(DMAMUX + 0x28U)          /*!< DMAMUX request multiplexer channel 10 configuration register */
#define DMAMUX_RM_CH11CFG                  REG32(DMAMUX + 0x2CU)          /*!< DMAMUX request multiplexer channel 11 configuration register */
#define DMAMUX_RM_CH12CFG                  REG32(DMAMUX + 0x30U)          /*!< DMAMUX request multiplexer channel 12 configuration register */
#define DMAMUX_RM_CH13CFG                  REG32(DMAMUX + 0x34U)          /*!< DMAMUX request multiplexer channel 13 configuration register */
#define DMAMUX_RM_CH14CFG                  REG32(DMAMUX + 0x38U)          /*!< DMAMUX request multiplexer channel 14 configuration register */
#define DMAMUX_RM_CH15CFG                  REG32(DMAMUX + 0x3CU)          /*!< DMAMUX request multiplexer channel 15 configuration register */
#define DMAMUX_RM_CH16CFG                  REG32(DMAMUX + 0x40U)          /*!< DMAMUX request multiplexer channel 16 configuration register */
#define DMAMUX_RM_CH17CFG                  REG32(DMAMUX + 0x44U)          /*!< DMAMUX request multiplexer channel 17 configuration register */
#define DMAMUX_RM_CH18CFG                  REG32(DMAMUX + 0x48U)          /*!< DMAMUX request multiplexer channel 18 configuration register */
#define DMAMUX_RM_CH19CFG                  REG32(DMAMUX + 0x4CU)          /*!< DMAMUX request multiplexer channel 19 configuration register */
#define DMAMUX_RM_CH20CFG                  REG32(DMAMUX + 0x50U)          /*!< DMAMUX request multiplexer channel 20 configuration register */
#define DMAMUX_RM_CH21CFG                  REG32(DMAMUX + 0x54U)          /*!< DMAMUX request multiplexer channel 21 configuration register */
#define DMAMUX_RM_CH22CFG                  REG32(DMAMUX + 0x58U)          /*!< DMAMUX request multiplexer channel 22 configuration register */
#define DMAMUX_RM_CH23CFG                  REG32(DMAMUX + 0x5CU)          /*!< DMAMUX request multiplexer channel 23 configuration register */
#define DMAMUX_RM_CH24CFG                  REG32(DMAMUX + 0x60U)          /*!< DMAMUX request multiplexer channel 24 configuration register */
#define DMAMUX_RM_CH25CFG                  REG32(DMAMUX + 0x64U)          /*!< DMAMUX request multiplexer channel 25 configuration register */
#define DMAMUX_RM_CH26CFG                  REG32(DMAMUX + 0x68U)          /*!< DMAMUX request multiplexer channel 26 configuration register */
#define DMAMUX_RM_CH27CFG                  REG32(DMAMUX + 0x6CU)          /*!< DMAMUX request multiplexer channel 27 configuration register */
#define DMAMUX_RM_CH28CFG                  REG32(DMAMUX + 0x70U)          /*!< DMAMUX request multiplexer channel 28 configuration register */
#define DMAMUX_RM_CH29CFG                  REG32(DMAMUX + 0x74U)          /*!< DMAMUX request multiplexer channel 29 configuration register */
#define DMAMUX_RM_CH30CFG                  REG32(DMAMUX + 0x78U)          /*!< DMAMUX request multiplexer channel 30 configuration register */
#define DMAMUX_RM_CH31CFG                  REG32(DMAMUX + 0x7CU)          /*!< DMAMUX request multiplexer channel 31 configuration register */
#define DMAMUX_RM_INTF                     REG32(DMAMUX + 0x80U)          /*!< DMAMUX request multiplexer channel interrupt flag register */
#define DMAMUX_RM_INTC                     REG32(DMAMUX + 0x84U)          /*!< DMAMUX request multiplexer channel interrupt flag clear register */
#define DMAMUX_RG_CH0CFG                   REG32(DMAMUX + 0x100U)         /*!< DMAMUX generator channel 0 configuration register */
#define DMAMUX_RG_CH1CFG                   REG32(DMAMUX + 0x104U)         /*!< DMAMUX generator channel 1 configuration register */
#define DMAMUX_RG_CH2CFG                   REG32(DMAMUX + 0x108U)         /*!< DMAMUX generator channel 2 configuration register */
#define DMAMUX_RG_CH3CFG                   REG32(DMAMUX + 0x10CU)         /*!< DMAMUX generator channel 3 configuration register */
#define DMAMUX_RG_CH4CFG                   REG32(DMAMUX + 0x110U)         /*!< DMAMUX generator channel 4 configuration register */
#define DMAMUX_RG_CH5CFG                   REG32(DMAMUX + 0x114U)         /*!< DMAMUX generator channel 5 configuration register */
#define DMAMUX_RG_CH6CFG                   REG32(DMAMUX + 0x118U)         /*!< DMAMUX generator channel 6 configuration register */
#define DMAMUX_RG_CH7CFG                   REG32(DMAMUX + 0x11CU)         /*!< DMAMUX generator channel 7 configuration register */
#define DMAMUX_RG_INTF                     REG32(DMAMUX + 0x140U)         /*!< DMAMUX generator channel interrupt flag register */
#define DMAMUX_RG_INTC                     REG32(DMAMUX + 0x144U)         /*!< DMAMUX rgenerator channel interrupt flag clear register */

