sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.h
/* bits definitions */
/* DMA_INTF */
#define DMA_INTF_FEEIF                     BIT(0)                         /*!< FIFO error and exception flag */
#define DMA_INTF_SDEIF                     BIT(2)                         /*!< single data mode exception flag */
#define DMA_INTF_TAEIF                     BIT(3)                         /*!< transfer access error flag */
#define DMA_INTF_HTFIF                     BIT(4)                         /*!< half transfer finish flag */
#define DMA_INTF_FTFIF                     BIT(5)                         /*!< full transger finish flag */

/* DMA_INTC */
#define DMA_INTC_FEEIFC                    BIT(0)                         /*!< clear FIFO error and exception flag */
#define DMA_INTC_SDEIFC                    BIT(2)                         /*!< clear single data mode exception flag */
#define DMA_INTC_TAEIFC                    BIT(3)                         /*!< clear single data mode exception flag */
#define DMA_INTC_HTFIFC                    BIT(4)                         /*!< clear half transfer finish flag */
#define DMA_INTC_FTFIFC                    BIT(5)                         /*!< clear full transger finish flag */

/* DMA_CHxCTL,x=0..15 */
#define DMA_CHXCTL_CHEN                    BIT(0)                         /*!< channel x enable */
#define DMA_CHXCTL_SDEIE                   BIT(1)                         /*!< enable bit for channel x single data mode exception interrupt */
#define DMA_CHXCTL_TAEIE                   BIT(2)                         /*!< enable bit for channel x tranfer access error interrupt */
#define DMA_CHXCTL_HTFIE                   BIT(3)                         /*!< enable bit for channel x half transfer finish interrupt */
#define DMA_CHXCTL_FTFIE                   BIT(4)                         /*!< enable bit for channel x full transfer finish interrupt */
#define DMA_CHXCTL_TFCS                    BIT(5)                         /*!< transfer flow controller select */
#define DMA_CHXCTL_TM                      BITS(6,7)                      /*!< transfer mode */
#define DMA_CHXCTL_CMEN                    BIT(8)                         /*!< circulation mode */
#define DMA_CHXCTL_PNAGA                   BIT(9)                         /*!< next address generation algorithm of peripheral */
#define DMA_CHXCTL_MNAGA                   BIT(10)                        /*!< next address generation algorithm of memory */
#define DMA_CHXCTL_PWIDTH                  BITS(11,12)                    /*!< transfer width of peipheral */
#define DMA_CHXCTL_MWIDTH                  BITS(13,14)                    /*!< transfer width of memory */
#define DMA_CHXCTL_PAIF                    BIT(15)                        /*!< peripheral address increment fixed */
#define DMA_CHXCTL_PRIO                    BITS(16,17)                    /*!< priority level */
#define DMA_CHXCTL_SBMEN                   BIT(18)                        /*!< switch-buffer mode enable */
#define DMA_CHXCTL_MBS                     BIT(19)                        /*!< memory buffer select */
#define DMA_CHXCTL_PBURST                  BITS(21,22)                    /*!< transfer burst type of peripheral */
#define DMA_CHXCTL_MBURST                  BITS(23,24)                    /*!< transfer burst type of memory */
#define DMA_CHXCTL_PCEN                    BIT(25)                        /*!< peripheral address circular enable */
#define DMA_CHXCTL_MCEN                    BIT(26)                        /*!< memory address circular enable */

/* DMA_CHxCNT,x=0..15 */
#define DMA_CHXCNT_CNT                     BITS(0,15)                     /*!< transfer counter */
#define DMA_CHXCNT_CCNTEN                  BIT(23)                        /*!< circular mode count enable */
#define DMA_CHXCNT_CCNT                    BITS(24,31)                    /*!< circular mode count */

/* DMA_CHxPADDR,x=0..15 */
#define DMA_CHXPADDR_PADDR                 BITS(0,31)                     /*!< peripheral base address */

/* DMA_CHxM0ADDR,x=0..15 */
#define DMA_CHXM0ADDR_M0ADDR               BITS(0,31)                     /*!< memory 0 base address */

/* DMA_CHxM1ADDR,x=0..15 */
#define DMA_CHXM1ADDR_M1ADDR               BITS(0,31)                     /*!< memory 1 base address */

/* DMA_CHxFCTL,x=0..15 */
#define DMA_CHXFCTL_FCCV                   BITS(0,1)                      /*!< FIFO counter critical value */
#define DMA_CHXFCTL_MDMEN                  BIT(2)                         /*!< multi-data mode enable */
#define DMA_CHXFCTL_FCNT                   BITS(3,5)                      /*!< FIFO counter */
#define DMA_CHXFCTL_FEEIE                  BIT(7)                         /*!< FIFO exception interrupt enable */

/* DMA_CHxCRCDATA, x=0..15 */
#define DMA_CHXPCRCDATA_CRC_PDATA           BITS(0,31)                    /*!< peripheral port data CRC */

/* DMA_CRCIDATA */
#define DMA_CRCIDATA_CRC_IDATA             BITS(0,31)                     /*!< configurable initial CRC data value */

/* DMA_PCRCCTL */
#define DMA_PCRCCTL_RST0                   BIT(0)                         /*!< peripheral data CRC register reset bit of channel 0 */
#define DMA_PCRCCTL_RST1                   BIT(1)                         /*!< peripheral data CRC register reset bit of channel 1 */
#define DMA_PCRCCTL_RST2                   BIT(2)                         /*!< peripheral data CRC register reset bit of channel 2 */
#define DMA_PCRCCTL_RST3                   BIT(3)                         /*!< peripheral data CRC register reset bit of channel 3 */
#define DMA_PCRCCTL_RST4                   BIT(4)                         /*!< peripheral data CRC register reset bit of channel 4 */
#define DMA_PCRCCTL_RST5                   BIT(5)                         /*!< peripheral data CRC register reset bit of channel 5 */
#define DMA_PCRCCTL_RST6                   BIT(6)                         /*!< peripheral data CRC register reset bit of channel 6 */
#define DMA_PCRCCTL_RST7                   BIT(7)                         /*!< peripheral data CRC register reset bit of channel 7 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMA_PCRCCTL_RST8                   BIT(8)                         /*!< peripheral data CRC register reset bit of channel 8 */
#define DMA_PCRCCTL_RST9                   BIT(9)                         /*!< peripheral data CRC register reset bit of channel 9 */
#define DMA_PCRCCTL_RST10                  BIT(10)                        /*!< peripheral data CRC register reset bit of channel 10 */
#define DMA_PCRCCTL_RST11                  BIT(11)                        /*!< peripheral data CRC register reset bit of channel 11 */
#define DMA_PCRCCTL_RST12                  BIT(12)                        /*!< peripheral data CRC register reset bit of channel 12 */
#define DMA_PCRCCTL_RST13                  BIT(13)                        /*!< peripheral data CRC register reset bit of channel 13 */
#define DMA_PCRCCTL_RST14                  BIT(14)                        /*!< peripheral data CRC register reset bit of channel 14 */
#define DMA_PCRCCTL_RST15                  BIT(15)                        /*!< peripheral data CRC register reset bit of channel 15 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* DMA_GCTL */
#define DMA_GCTL_LPRREN                    BIT(0)                         /*!< enable round-robin for channels with low software priority level */
#define DMA_GCTL_MPRREN                    BIT(1)                         /*!< enable round-robin for channels with medium software priority level */
#define DMA_GCTL_HPRREN                    BIT(2)                         /*!< enable round-robin for channels with high software priority level */
#define DMA_GCTL_UHPRREN                   BIT(3)                         /*!< enable round-robin for channels with ultra high software priority level */

/* DMA_CHxTOCR, x=0..15 */
#define DMA_CHXTOCTL_PEROID                BITS(0,20)                     /*!< timeout threshold value */
#define DMA_CHXTOCTL_CHTOEN                BIT(31)                        /*!< channel transfer timeout monitor enable */

