sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.h
/* DMA_TOIF */
#define DMA_TOINTF_TOIF0                   BIT(0)                          /*!< transfer timeout flag of channel 0 */
#define DMA_TOINTF_TOIF1                   BIT(1)                          /*!< transfer timeout flag of channel 1 */
#define DMA_TOINTF_TOIF2                   BIT(2)                          /*!< transfer timeout flag of channel 2 */
#define DMA_TOINTF_TOIF3                   BIT(3)                          /*!< transfer timeout flag of channel 3 */
#define DMA_TOINTF_TOIF4                   BIT(4)                          /*!< transfer timeout flag of channel 4 */
#define DMA_TOINTF_TOIF5                   BIT(5)                          /*!< transfer timeout flag of channel 5 */
#define DMA_TOINTF_TOIF6                   BIT(6)                          /*!< transfer timeout flag of channel 6 */
#define DMA_TOINTF_TOIF7                   BIT(7)                          /*!< transfer timeout flag of channel 7 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMA_TOINTF_TOIF8                   BIT(8)                          /*!< transfer timeout flag of channel 8 */
#define DMA_TOINTF_TOIF9                   BIT(9)                          /*!< transfer timeout flag of channel 9 */
#define DMA_TOINTF_TOIF10                  BIT(10)                         /*!< transfer timeout flag of channel 10 */
#define DMA_TOINTF_TOIF11                  BIT(11)                         /*!< transfer timeout flag of channel 11 */
#define DMA_TOINTF_TOIF12                  BIT(12)                         /*!< transfer timeout flag of channel 12 */
#define DMA_TOINTF_TOIF13                  BIT(13)                         /*!< transfer timeout flag of channel 13 */
#define DMA_TOINTF_TOIF14                  BIT(14)                         /*!< transfer timeout flag of channel 14 */
#define DMA_TOINTF_TOIF15                  BIT(15)                         /*!< transfer timeout flag of channel 15 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* DMA_TOIE */
#define DMA_TOINTEN_TOIE0                  BIT(0)                          /*!< transfer timeout interrupt enable bit of channel 0 */
#define DMA_TOINTEN_TOIE1                  BIT(1)                          /*!< transfer timeout interrupt enable bit of channel 1 */
#define DMA_TOINTEN_TOIE2                  BIT(2)                          /*!< transfer timeout interrupt enable bit of channel 2 */
#define DMA_TOINTEN_TOIE3                  BIT(3)                          /*!< transfer timeout interrupt enable bit of channel 3 */
#define DMA_TOINTEN_TOIE4                  BIT(4)                          /*!< transfer timeout interrupt enable bit of channel 4 */
#define DMA_TOINTEN_TOIE5                  BIT(5)                          /*!< transfer timeout interrupt enable bit of channel 5 */
#define DMA_TOINTEN_TOIE6                  BIT(6)                          /*!< transfer timeout interrupt enable bit of channel 6 */
#define DMA_TOINTEN_TOIE7                  BIT(7)                          /*!< transfer timeout interrupt enable bit of channel 7 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMA_TOINTEN_TOIE8                  BIT(8)                          /*!< transfer timeout interrupt enable bit of channel 8 */
#define DMA_TOINTEN_TOIE9                  BIT(9)                          /*!< transfer timeout interrupt enable bit of channel 9 */
#define DMA_TOINTEN_TOIE10                 BIT(10)                         /*!< transfer timeout interrupt enable bit of channel 10 */
#define DMA_TOINTEN_TOIE11                 BIT(11)                         /*!< transfer timeout interrupt enable bit of channel 11 */
#define DMA_TOINTEN_TOIE12                 BIT(12)                         /*!< transfer timeout interrupt enable bit of channel 12 */
#define DMA_TOINTEN_TOIE13                 BIT(13)                         /*!< transfer timeout interrupt enable bit of channel 13 */
#define DMA_TOINTEN_TOIE14                 BIT(14)                         /*!< transfer timeout interrupt enable bit of channel 14 */
#define DMA_TOINTEN_TOIE15                 BIT(15)                         /*!< transfer timeout interrupt enable bit of channel 15 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* DMA_TFIF */
#define DMA_TFINTF_TFIF0                   BIT(0)                          /*!< TMR fault flag of channel 0 */
#define DMA_TFINTF_TFIF1                   BIT(1)                          /*!< TMR fault flag of channel 1 */
#define DMA_TFINTF_TFIF2                   BIT(2)                          /*!< TMR fault flag of channel 2 */
#define DMA_TFINTF_TFIF3                   BIT(3)                          /*!< TMR fault flag of channel 3 */
#define DMA_TFINTF_TFIF4                   BIT(4)                          /*!< TMR fault flag of channel 4 */
#define DMA_TFINTF_TFIF5                   BIT(5)                          /*!< TMR fault flag of channel 5 */
#define DMA_TFINTF_TFIF6                   BIT(6)                          /*!< TMR fault flag of channel 6 */
#define DMA_TFINTF_TFIF7                   BIT(7)                          /*!< TMR fault flag of channel 7 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMA_TFINTF_TFIF8                   BIT(8)                          /*!< TMR fault flag of channel 8 */
#define DMA_TFINTF_TFIF9                   BIT(9)                          /*!< TMR fault flag of channel 9 */
#define DMA_TFINTF_TFIF10                  BIT(10)                         /*!< TMR fault flag of channel 10 */
#define DMA_TFINTF_TFIF11                  BIT(11)                         /*!< TMR fault flag of channel 11 */
#define DMA_TFINTF_TFIF12                  BIT(12)                         /*!< TMR fault flag of channel 12 */
#define DMA_TFINTF_TFIF13                  BIT(13)                         /*!< TMR fault flag of channel 13 */
#define DMA_TFINTF_TFIF14                  BIT(14)                         /*!< TMR fault flag of channel 14 */
#define DMA_TFINTF_TFIF15                  BIT(15)                         /*!< TMR fault flag of channel 15 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* DMA_TFIE */
#define DMA_TFINTEN_TFIE0                  BIT(0)                          /*!< TMR fault interrupt enable bit of channel 0 */
#define DMA_TFINTEN_TFIE1                  BIT(1)                          /*!< TMR fault interrupt enable bit of channel 1 */
#define DMA_TFINTEN_TFIE2                  BIT(2)                          /*!< TMR fault interrupt enable bit of channel 2 */
#define DMA_TFINTEN_TFIE3                  BIT(3)                          /*!< TMR fault interrupt enable bit of channel 3 */
#define DMA_TFINTEN_TFIE4                  BIT(4)                          /*!< TMR fault interrupt enable bit of channel 4 */
#define DMA_TFINTEN_TFIE5                  BIT(5)                          /*!< TMR fault interrupt enable bit of channel 5 */
#define DMA_TFINTEN_TFIE6                  BIT(6)                          /*!< TMR fault interrupt enable bit of channel 6 */
#define DMA_TFINTEN_TFIE7                  BIT(7)                          /*!< TMR fault interrupt enable bit of channel 7 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMA_TFINTEN_TFIE8                  BIT(8)                          /*!< TMR fault interrupt enable bit of channel 8 */
#define DMA_TFINTEN_TFIE9                  BIT(9)                          /*!< TMR fault interrupt enable bit of channel 9 */
#define DMA_TFINTEN_TFIE10                 BIT(10)                         /*!< TMR fault interrupt enable bit of channel 10 */
#define DMA_TFINTEN_TFIE11                 BIT(11)                         /*!< TMR fault interrupt enable bit of channel 11 */
#define DMA_TFINTEN_TFIE12                 BIT(12)                         /*!< TMR fault interrupt enable bit of channel 12 */
#define DMA_TFINTEN_TFIE13                 BIT(13)                         /*!< TMR fault interrupt enable bit of channel 13 */
#define DMA_TFINTEN_TFIE14                 BIT(14)                         /*!< TMR fault interrupt enable bit of channel 14 */
#define DMA_TFINTEN_TFIE15                 BIT(15)                         /*!< TMR fault interrupt enable bit of channel 15 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* DMA_CHxPCADDR, x=0..15 */
#define DMA_CHXPCADDR_PCADDR               BITS(0,31)                     /*!< peripheral port address pointing to the peripheral port data */

