sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.h
/* DMA_CHxMCADDR, x=0..15 */
#define DMA_CHXMCADDR_MCADDR               BITS(0,31)                     /*!< memory port address pointing to the memory port data */

/* DMAMUX_RM_CHxCFG,x=0..31 */
#define DMAMUX_RM_CHXCFG_MUXID             BITS(0,7)                     /*!< multiplexer input identification */
#define DMAMUX_RM_CHXCFG_SOIE              BIT(8)                        /*!< synchronization overrun interrupt enable */
#define DMAMUX_RM_CHXCFG_EVGEN             BIT(9)                        /*!< event generation enable */
#define DMAMUX_RM_CHXCFG_SYNCEN            BIT(16)                       /*!< synchronization enable */
#define DMAMUX_RM_CHXCFG_SYNCP             BITS(17,18)                   /*!< synchronization input polarity */
#define DMAMUX_RM_CHXCFG_NBR               BITS(19,23)                   /*!< number of DMA requests to forward */
#define DMAMUX_RM_CHXCFG_SYNCID            BITS(24,28)                   /*!< synchronization input identification */

/* DMAMUX_RM_INTF */
#define DMAMUX_RM_INTF_SOIF0               BIT(0)                        /*!< synchronization overrun event flag of request multiplexer channel 0 */
#define DMAMUX_RM_INTF_SOIF1               BIT(1)                        /*!< synchronization overrun event flag of request multiplexer channel 1 */
#define DMAMUX_RM_INTF_SOIF2               BIT(2)                        /*!< synchronization overrun event flag of request multiplexer channel 2 */
#define DMAMUX_RM_INTF_SOIF3               BIT(3)                        /*!< synchronization overrun event flag of request multiplexer channel 3 */
#define DMAMUX_RM_INTF_SOIF4               BIT(4)                        /*!< synchronization overrun event flag of request multiplexer channel 4 */
#define DMAMUX_RM_INTF_SOIF5               BIT(5)                        /*!< synchronization overrun event flag of request multiplexer channel 5 */
#define DMAMUX_RM_INTF_SOIF6               BIT(6)                        /*!< synchronization overrun event flag of request multiplexer channel 6 */
#define DMAMUX_RM_INTF_SOIF7               BIT(7)                        /*!< synchronization overrun event flag of request multiplexer channel 7 */
#define DMAMUX_RM_INTF_SOIF8               BIT(8)                        /*!< synchronization overrun event flag of request multiplexer channel 8 */
#define DMAMUX_RM_INTF_SOIF9               BIT(9)                        /*!< synchronization overrun event flag of request multiplexer channel 9 */
#define DMAMUX_RM_INTF_SOIF10              BIT(10)                       /*!< synchronization overrun event flag of request multiplexer channel 10 */
#define DMAMUX_RM_INTF_SOIF11              BIT(11)                       /*!< synchronization overrun event flag of request multiplexer channel 11 */
#define DMAMUX_RM_INTF_SOIF12              BIT(12)                       /*!< synchronization overrun event flag of request multiplexer channel 12 */
#define DMAMUX_RM_INTF_SOIF13              BIT(13)                       /*!< synchronization overrun event flag of request multiplexer channel 13 */
#define DMAMUX_RM_INTF_SOIF14              BIT(14)                       /*!< synchronization overrun event flag of request multiplexer channel 14 */
#define DMAMUX_RM_INTF_SOIF15              BIT(15)                       /*!< synchronization overrun event flag of request multiplexer channel 15 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMAMUX_RM_INTF_SOIF16              BIT(16)                       /*!< synchronization overrun event flag of request multiplexer channel 16 */
#define DMAMUX_RM_INTF_SOIF17              BIT(17)                       /*!< synchronization overrun event flag of request multiplexer channel 17 */
#define DMAMUX_RM_INTF_SOIF18              BIT(18)                       /*!< synchronization overrun event flag of request multiplexer channel 18 */
#define DMAMUX_RM_INTF_SOIF19              BIT(19)                       /*!< synchronization overrun event flag of request multiplexer channel 19 */
#define DMAMUX_RM_INTF_SOIF20              BIT(20)                       /*!< synchronization overrun event flag of request multiplexer channel 20 */
#define DMAMUX_RM_INTF_SOIF21              BIT(21)                       /*!< synchronization overrun event flag of request multiplexer channel 21 */
#define DMAMUX_RM_INTF_SOIF22              BIT(22)                       /*!< synchronization overrun event flag of request multiplexer channel 22 */
#define DMAMUX_RM_INTF_SOIF23              BIT(23)                       /*!< synchronization overrun event flag of request multiplexer channel 23 */
#define DMAMUX_RM_INTF_SOIF24              BIT(24)                       /*!< synchronization overrun event flag of request multiplexer channel 24 */
#define DMAMUX_RM_INTF_SOIF25              BIT(25)                       /*!< synchronization overrun event flag of request multiplexer channel 25 */
#define DMAMUX_RM_INTF_SOIF26              BIT(26)                       /*!< synchronization overrun event flag of request multiplexer channel 26 */
#define DMAMUX_RM_INTF_SOIF27              BIT(27)                       /*!< synchronization overrun event flag of request multiplexer channel 27 */
#define DMAMUX_RM_INTF_SOIF28              BIT(28)                       /*!< synchronization overrun event flag of request multiplexer channel 28 */
#define DMAMUX_RM_INTF_SOIF29              BIT(29)                       /*!< synchronization overrun event flag of request multiplexer channel 29 */
#define DMAMUX_RM_INTF_SOIF30              BIT(30)                       /*!< synchronization overrun event flag of request multiplexer channel 30 */
#define DMAMUX_RM_INTF_SOIF31              BIT(31)                       /*!< synchronization overrun event flag of request multiplexer channel 31 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* DMAMUX_RM_INTC */
#define DMAMUX_RM_INTC_SOIFC0              BIT(0)                        /*!< clear bit for synchronization overrun event flag of request multiplexer channel 0 */
#define DMAMUX_RM_INTC_SOIFC1              BIT(1)                        /*!< clear bit for synchronization overrun event flag of request multiplexer channel 1 */
#define DMAMUX_RM_INTC_SOIFC2              BIT(2)                        /*!< clear bit for synchronization overrun event flag of request multiplexer channel 2 */
#define DMAMUX_RM_INTC_SOIFC3              BIT(3)                        /*!< clear bit for synchronization overrun event flag of request multiplexer channel 3 */
#define DMAMUX_RM_INTC_SOIFC4              BIT(4)                        /*!< clear bit for synchronization overrun event flag of request multiplexer channel 4 */
#define DMAMUX_RM_INTC_SOIFC5              BIT(5)                        /*!< clear bit for synchronization overrun event flag of request multiplexer channel 5 */
#define DMAMUX_RM_INTC_SOIFC6              BIT(6)                        /*!< clear bit for synchronization overrun event flag of request multiplexer channel 6 */
#define DMAMUX_RM_INTC_SOIFC7              BIT(7)                        /*!< clear bit for synchronization overrun event flag of request multiplexer channel 7 */
#define DMAMUX_RM_INTC_SOIFC8              BIT(8)                        /*!< clear bit for synchronization overrun event flag of request multiplexer channel 8 */
#define DMAMUX_RM_INTC_SOIFC9              BIT(9)                        /*!< clear bit for synchronization overrun event flag of request multiplexer channel 9 */
#define DMAMUX_RM_INTC_SOIFC10             BIT(10)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 10 */
#define DMAMUX_RM_INTC_SOIFC11             BIT(11)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 11 */
#define DMAMUX_RM_INTC_SOIFC12             BIT(12)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 12 */
#define DMAMUX_RM_INTC_SOIFC13             BIT(13)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 13 */
#define DMAMUX_RM_INTC_SOIFC14             BIT(14)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 14 */
#define DMAMUX_RM_INTC_SOIFC15             BIT(15)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 15 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMAMUX_RM_INTC_SOIFC16             BIT(16)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 16 */
#define DMAMUX_RM_INTC_SOIFC17             BIT(17)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 17 */
#define DMAMUX_RM_INTC_SOIFC18             BIT(18)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 18 */
#define DMAMUX_RM_INTC_SOIFC19             BIT(19)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 19 */
#define DMAMUX_RM_INTC_SOIFC20             BIT(20)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 20 */
#define DMAMUX_RM_INTC_SOIFC21             BIT(21)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 21 */
#define DMAMUX_RM_INTC_SOIFC22             BIT(22)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 22 */
#define DMAMUX_RM_INTC_SOIFC23             BIT(23)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 23 */
#define DMAMUX_RM_INTC_SOIFC24             BIT(24)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 24 */
#define DMAMUX_RM_INTC_SOIFC25             BIT(25)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 25 */
#define DMAMUX_RM_INTC_SOIFC26             BIT(26)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 26 */
#define DMAMUX_RM_INTC_SOIFC27             BIT(27)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 27 */
#define DMAMUX_RM_INTC_SOIFC28             BIT(28)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 28 */
#define DMAMUX_RM_INTC_SOIFC29             BIT(29)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 29 */
#define DMAMUX_RM_INTC_SOIFC30             BIT(30)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 30 */
#define DMAMUX_RM_INTC_SOIFC31             BIT(31)                       /*!< clear bit for synchronization overrun event flag of request multiplexer channel 31 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

