sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.h
/* DMAMUX request multiplexer channel */
typedef enum {
    DMAMUX_MUXCH0 = 0U,                                                                                                /*!< DMAMUX request multiplexer channel 0 */
    DMAMUX_MUXCH1,                                                                                                     /*!< DMAMUX request multiplexer channel 1 */
    DMAMUX_MUXCH2,                                                                                                     /*!< DMAMUX request multiplexer channel 2 */
    DMAMUX_MUXCH3,                                                                                                     /*!< DMAMUX request multiplexer channel 3 */
    DMAMUX_MUXCH4,                                                                                                     /*!< DMAMUX request multiplexer channel 4 */
    DMAMUX_MUXCH5,                                                                                                     /*!< DMAMUX request multiplexer channel 5 */
    DMAMUX_MUXCH6,                                                                                                     /*!< DMAMUX request multiplexer channel 6 */
    DMAMUX_MUXCH7,                                                                                                     /*!< DMAMUX request multiplexer channel 7 */
    DMAMUX_MUXCH8,                                                                                                     /*!< DMAMUX request multiplexer channel 8 */
    DMAMUX_MUXCH9,                                                                                                     /*!< DMAMUX request multiplexer channel 9 */
    DMAMUX_MUXCH10,                                                                                                    /*!< DMAMUX request multiplexer channel 10 */
    DMAMUX_MUXCH11,                                                                                                    /*!< DMAMUX request multiplexer channel 11 */
    DMAMUX_MUXCH12,                                                                                                    /*!< DMAMUX request multiplexer channel 12 */
    DMAMUX_MUXCH13,                                                                                                    /*!< DMAMUX request multiplexer channel 13 */
    DMAMUX_MUXCH14,                                                                                                    /*!< DMAMUX request multiplexer channel 14 */
    DMAMUX_MUXCH15,                                                                                                    /*!< DMAMUX request multiplexer channel 15 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    DMAMUX_MUXCH16,                                                                                                    /*!< DMAMUX request multiplexer channel 16 */
    DMAMUX_MUXCH17,                                                                                                    /*!< DMAMUX request multiplexer channel 17 */
    DMAMUX_MUXCH18,                                                                                                    /*!< DMAMUX request multiplexer channel 18 */
    DMAMUX_MUXCH19,                                                                                                    /*!< DMAMUX request multiplexer channel 19 */
    DMAMUX_MUXCH20,                                                                                                    /*!< DMAMUX request multiplexer channel 20 */
    DMAMUX_MUXCH21,                                                                                                    /*!< DMAMUX request multiplexer channel 21 */
    DMAMUX_MUXCH22,                                                                                                    /*!< DMAMUX request multiplexer channel 22 */
    DMAMUX_MUXCH23,                                                                                                    /*!< DMAMUX request multiplexer channel 23 */
    DMAMUX_MUXCH24,                                                                                                    /*!< DMAMUX request multiplexer channel 24 */
    DMAMUX_MUXCH25,                                                                                                    /*!< DMAMUX request multiplexer channel 25 */
    DMAMUX_MUXCH26,                                                                                                    /*!< DMAMUX request multiplexer channel 26 */
    DMAMUX_MUXCH27,                                                                                                    /*!< DMAMUX request multiplexer channel 27 */
    DMAMUX_MUXCH28,                                                                                                    /*!< DMAMUX request multiplexer channel 28 */
    DMAMUX_MUXCH29,                                                                                                    /*!< DMAMUX request multiplexer channel 29 */
    DMAMUX_MUXCH30,                                                                                                    /*!< DMAMUX request multiplexer channel 30 */
    DMAMUX_MUXCH31                                                                                                     /*!< DMAMUX request multiplexer channel 31 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
} dmamux_multiplexer_channel_enum;

/* DMAMUX request generator channel */
typedef enum {
    DMAMUX_GENCH0 = 0U,                                                                                                /*!< DMAMUX request generator channel 0 */
    DMAMUX_GENCH1,                                                                                                     /*!< DMAMUX request generator channel 1 */
    DMAMUX_GENCH2,                                                                                                     /*!< DMAMUX request generator channel 2 */
    DMAMUX_GENCH3,                                                                                                     /*!< DMAMUX request generator channel 3 */
    DMAMUX_GENCH4,                                                                                                     /*!< DMAMUX request generator channel 4 */
    DMAMUX_GENCH5,                                                                                                     /*!< DMAMUX request generator channel 5 */
    DMAMUX_GENCH6,                                                                                                     /*!< DMAMUX request generator channel 6 */
    DMAMUX_GENCH7                                                                                                      /*!< DMAMUX request generator channel 7 */
} dmamux_generator_channel_enum;

/* DMAMUX interrupt enable or disable */
typedef enum {
    /* interrupts in CHxCFG register */
    DMAMUX_INT_MUXCH0_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH0CFG_REG_OFFSET, 8U),                                        /*!< DMAMUX request multiplexer channel 0 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH1_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH1CFG_REG_OFFSET, 8U),                                        /*!< DMAMUX request multiplexer channel 1 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH2_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH2CFG_REG_OFFSET, 8U),                                        /*!< DMAMUX request multiplexer channel 2 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH3_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH3CFG_REG_OFFSET, 8U),                                        /*!< DMAMUX request multiplexer channel 3 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH4_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH4CFG_REG_OFFSET, 8U),                                        /*!< DMAMUX request multiplexer channel 4 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH5_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH5CFG_REG_OFFSET, 8U),                                        /*!< DMAMUX request multiplexer channel 5 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH6_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH6CFG_REG_OFFSET, 8U),                                        /*!< DMAMUX request multiplexer channel 6 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH7_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH7CFG_REG_OFFSET, 8U),                                        /*!< DMAMUX request multiplexer channel 7 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH8_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH8CFG_REG_OFFSET, 8U),                                        /*!< DMAMUX request multiplexer channel 8 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH9_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH9CFG_REG_OFFSET, 8U),                                        /*!< DMAMUX request multiplexer channel 9 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH10_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH10CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 10 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH11_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH11CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 11 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH12_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH12CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 12 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH13_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH13CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 13 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH14_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH14CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 14 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH15_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH15CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 15 synchronization overrun interrupt */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    DMAMUX_INT_MUXCH16_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH16CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 16 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH17_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH17CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 17 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH18_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH18CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 18 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH19_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH19CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 19 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH20_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH20CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 20 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH21_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH21CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 21 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH22_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH22CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 22 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH23_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH23CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 23 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH24_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH24CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 24 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH25_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH25CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 25 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH26_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH26CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 26 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH27_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH27CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 27 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH28_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH28CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 28 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH29_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH29CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 29 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH30_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH30CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 30 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH31_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH31CFG_REG_OFFSET, 8U),                                       /*!< DMAMUX request multiplexer channel 31 synchronization overrun interrupt */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    DMAMUX_INT_GENCH0_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_CH0CFG_REG_OFFSET, 8U),                                        /*!< DMAMUX request generator channel 0 trigger overrun interrupt */
    DMAMUX_INT_GENCH1_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_CH1CFG_REG_OFFSET, 8U),                                        /*!< DMAMUX request generator channel 1 trigger overrun interrupt */
    DMAMUX_INT_GENCH2_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_CH2CFG_REG_OFFSET, 8U),                                        /*!< DMAMUX request generator channel 2 trigger overrun interrupt */
    DMAMUX_INT_GENCH3_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_CH3CFG_REG_OFFSET, 8U),                                        /*!< DMAMUX request generator channel 3 trigger overrun interrupt */
    DMAMUX_INT_GENCH4_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_CH4CFG_REG_OFFSET, 8U),                                        /*!< DMAMUX request generator channel 4 trigger overrun interrupt */
    DMAMUX_INT_GENCH5_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_CH5CFG_REG_OFFSET, 8U),                                        /*!< DMAMUX request generator channel 5 trigger overrun interrupt */
    DMAMUX_INT_GENCH6_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_CH6CFG_REG_OFFSET, 8U),                                        /*!< DMAMUX request generator channel 6 trigger overrun interrupt */
    DMAMUX_INT_GENCH7_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_CH7CFG_REG_OFFSET, 8U)                                         /*!< DMAMUX request generator channel 7 trigger overrun interrupt */
} dmamux_interrupt_enum;

/* DMAMUX flags */
typedef enum {
    /* flags in INTF register */
    DMAMUX_FLAG_MUXCH0_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 0U),                                         /*!< DMAMUX request multiplexer channel 0 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH1_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 1U),                                         /*!< DMAMUX request multiplexer channel 1 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH2_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 2U),                                         /*!< DMAMUX request multiplexer channel 2 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH3_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 3U),                                         /*!< DMAMUX request multiplexer channel 3 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH4_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 4U),                                         /*!< DMAMUX request multiplexer channel 4 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH5_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 5U),                                         /*!< DMAMUX request multiplexer channel 5 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH6_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 6U),                                         /*!< DMAMUX request multiplexer channel 6 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH7_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 7U),                                         /*!< DMAMUX request multiplexer channel 7 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH8_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 8U),                                         /*!< DMAMUX request multiplexer channel 8 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH9_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 9U),                                         /*!< DMAMUX request multiplexer channel 9 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH10_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 10U),                                        /*!< DMAMUX request multiplexer channel 10 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH11_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 11U),                                        /*!< DMAMUX request multiplexer channel 11 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH12_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 12U),                                        /*!< DMAMUX request multiplexer channel 12 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH13_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 13U),                                        /*!< DMAMUX request multiplexer channel 13 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH14_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 14U),                                        /*!< DMAMUX request multiplexer channel 14 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH15_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 15U),                                        /*!< DMAMUX request multiplexer channel 15 synchronization overrun flag */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    DMAMUX_FLAG_MUXCH16_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 16U),                                        /*!< DMAMUX request multiplexer channel 16 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH17_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 17U),                                        /*!< DMAMUX request multiplexer channel 17 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH18_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 18U),                                        /*!< DMAMUX request multiplexer channel 18 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH19_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 19U),                                        /*!< DMAMUX request multiplexer channel 19 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH20_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 20U),                                        /*!< DMAMUX request multiplexer channel 20 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH21_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 21U),                                        /*!< DMAMUX request multiplexer channel 21 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH22_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 22U),                                        /*!< DMAMUX request multiplexer channel 22 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH23_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 23U),                                        /*!< DMAMUX request multiplexer channel 23 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH24_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 24U),                                        /*!< DMAMUX request multiplexer channel 24 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH25_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 25U),                                        /*!< DMAMUX request multiplexer channel 25 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH26_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 26U),                                        /*!< DMAMUX request multiplexer channel 26 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH27_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 27U),                                        /*!< DMAMUX request multiplexer channel 27 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH28_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 28U),                                        /*!< DMAMUX request multiplexer channel 28 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH29_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 29U),                                        /*!< DMAMUX request multiplexer channel 29 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH30_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 30U),                                        /*!< DMAMUX request multiplexer channel 30 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH31_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 31U),                                        /*!< DMAMUX request multiplexer channel 31 synchronization overrun flag */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    DMAMUX_FLAG_GENCH0_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_INTF_REG_OFFSET, 0U),                                         /*!< DMAMUX request generator channel 0 trigger overrun flag */
    DMAMUX_FLAG_GENCH1_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_INTF_REG_OFFSET, 1U),                                         /*!< DMAMUX request generator channel 1 trigger overrun flag */
    DMAMUX_FLAG_GENCH2_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_INTF_REG_OFFSET, 2U),                                         /*!< DMAMUX request generator channel 2 trigger overrun flag */
    DMAMUX_FLAG_GENCH3_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_INTF_REG_OFFSET, 3U),                                         /*!< DMAMUX request generator channel 3 trigger overrun flag */
    DMAMUX_FLAG_GENCH4_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_INTF_REG_OFFSET, 4U),                                         /*!< DMAMUX request generator channel 4 trigger overrun flag */
    DMAMUX_FLAG_GENCH5_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_INTF_REG_OFFSET, 5U),                                         /*!< DMAMUX request generator channel 5 trigger overrun flag */
    DMAMUX_FLAG_GENCH6_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_INTF_REG_OFFSET, 6U),                                         /*!< DMAMUX request generator channel 6 trigger overrun flag */
    DMAMUX_FLAG_GENCH7_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_INTF_REG_OFFSET, 7U)                                          /*!< DMAMUX request generator channel 7 trigger overrun flag */
} dmamux_flag_enum;

