sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.h
/* DMAMUX interrupt flags */
typedef enum {
    /* interrupt flags in INTF register */
    DMAMUX_INT_FLAG_MUXCH0_SO  = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 0U, DMAMUX_RM_CH0CFG_REG_OFFSET, 8U),   /*!< DMAMUX request multiplexer channel 0 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH1_SO  = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 1U, DMAMUX_RM_CH1CFG_REG_OFFSET, 8U),   /*!< DMAMUX request multiplexer channel 1 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH2_SO  = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 2U, DMAMUX_RM_CH2CFG_REG_OFFSET, 8U),   /*!< DMAMUX request multiplexer channel 2 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH3_SO  = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 3U, DMAMUX_RM_CH3CFG_REG_OFFSET, 8U),   /*!< DMAMUX request multiplexer channel 3 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH4_SO  = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 4U, DMAMUX_RM_CH4CFG_REG_OFFSET, 8U),   /*!< DMAMUX request multiplexer channel 4 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH5_SO  = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 5U, DMAMUX_RM_CH5CFG_REG_OFFSET, 8U),   /*!< DMAMUX request multiplexer channel 5 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH6_SO  = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 6U, DMAMUX_RM_CH6CFG_REG_OFFSET, 8U),   /*!< DMAMUX request multiplexer channel 6 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH7_SO  = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 7U, DMAMUX_RM_CH7CFG_REG_OFFSET, 8U),   /*!< DMAMUX request multiplexer channel 7 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH8_SO  = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 8U, DMAMUX_RM_CH8CFG_REG_OFFSET, 8U),   /*!< DMAMUX request multiplexer channel 8 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH9_SO  = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 9U, DMAMUX_RM_CH9CFG_REG_OFFSET, 8U),   /*!< DMAMUX request multiplexer channel 9 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH10_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 10U, DMAMUX_RM_CH10CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 10 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH11_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 11U, DMAMUX_RM_CH11CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 11 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH12_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 12U, DMAMUX_RM_CH12CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 12 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH13_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 13U, DMAMUX_RM_CH13CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 13 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH14_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 14U, DMAMUX_RM_CH14CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 14 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH15_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 15U, DMAMUX_RM_CH15CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 15 synchronization overrun interrupt flag */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    DMAMUX_INT_FLAG_MUXCH16_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 16U, DMAMUX_RM_CH16CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 16 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH17_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 17U, DMAMUX_RM_CH17CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 17 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH18_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 18U, DMAMUX_RM_CH18CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 18 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH19_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 19U, DMAMUX_RM_CH19CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 19 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH20_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 20U, DMAMUX_RM_CH20CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 20 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH21_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 21U, DMAMUX_RM_CH21CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 21 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH22_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 22U, DMAMUX_RM_CH22CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 22 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH23_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 23U, DMAMUX_RM_CH23CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 23 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH24_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 24U, DMAMUX_RM_CH24CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 24 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH25_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 25U, DMAMUX_RM_CH25CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 25 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH26_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 26U, DMAMUX_RM_CH26CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 26 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH27_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 27U, DMAMUX_RM_CH27CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 27 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH28_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 28U, DMAMUX_RM_CH28CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 28 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH29_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 29U, DMAMUX_RM_CH29CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 29 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH30_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 30U, DMAMUX_RM_CH30CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 30 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH31_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 31U, DMAMUX_RM_CH31CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 31 synchronization overrun interrupt flag */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    DMAMUX_INT_FLAG_GENCH0_TO  = DMAMUX_REGIDX_BIT2(DMAMUX_RG_INTF_REG_OFFSET, 0U, DMAMUX_RG_CH0CFG_REG_OFFSET, 8U),   /*!< DMAMUX request generator channel 0 trigger overrun interrupt flag */
    DMAMUX_INT_FLAG_GENCH1_TO  = DMAMUX_REGIDX_BIT2(DMAMUX_RG_INTF_REG_OFFSET, 1U, DMAMUX_RG_CH1CFG_REG_OFFSET, 8U),   /*!< DMAMUX request generator channel 1 trigger overrun interrupt flag */
    DMAMUX_INT_FLAG_GENCH2_TO  = DMAMUX_REGIDX_BIT2(DMAMUX_RG_INTF_REG_OFFSET, 2U, DMAMUX_RG_CH2CFG_REG_OFFSET, 8U),   /*!< DMAMUX request generator channel 2 trigger overrun interrupt flag */
    DMAMUX_INT_FLAG_GENCH3_TO  = DMAMUX_REGIDX_BIT2(DMAMUX_RG_INTF_REG_OFFSET, 3U, DMAMUX_RG_CH3CFG_REG_OFFSET, 8U),   /*!< DMAMUX request generator channel 3 trigger overrun interrupt flag */
    DMAMUX_INT_FLAG_GENCH4_TO  = DMAMUX_REGIDX_BIT2(DMAMUX_RG_INTF_REG_OFFSET, 4U, DMAMUX_RG_CH4CFG_REG_OFFSET, 8U),   /*!< DMAMUX request generator channel 4 trigger overrun interrupt flag */
    DMAMUX_INT_FLAG_GENCH5_TO  = DMAMUX_REGIDX_BIT2(DMAMUX_RG_INTF_REG_OFFSET, 5U, DMAMUX_RG_CH5CFG_REG_OFFSET, 8U),   /*!< DMAMUX request generator channel 5 trigger overrun interrupt flag */
    DMAMUX_INT_FLAG_GENCH6_TO  = DMAMUX_REGIDX_BIT2(DMAMUX_RG_INTF_REG_OFFSET, 6U, DMAMUX_RG_CH6CFG_REG_OFFSET, 8U),   /*!< DMAMUX request generator channel 6 trigger overrun interrupt flag */
    DMAMUX_INT_FLAG_GENCH7_TO  = DMAMUX_REGIDX_BIT2(DMAMUX_RG_INTF_REG_OFFSET, 7U, DMAMUX_RG_CH7CFG_REG_OFFSET, 8U)    /*!< DMAMUX request generator channel 7 trigger overrun interrupt flag */
} dmamux_interrupt_flag_enum;

/* DMA channel flag shift */
#define DMA_FLAG_ADD(flag,channel)        ((uint32_t)((flag) << ((((uint32_t)((uint32_t)(channel) & 0x03U) * 6U)) + ((uint32_t)(((uint32_t)(channel) & 0x03U) >> 1U) & 0x01U) * 4U)))

/* DMA_register address */
#define DMA_CHCTL(dma,channel)            REG32(((dma) + 0x20U) + 0x18U * (uint32_t)(channel))                                   /*!< DMA channel CHXCTL register  */
#define DMA_CHCNT(dma,channel)            REG32(((dma) + 0x24U) + 0x18U * (uint32_t)(channel))                                   /*!< DMA channel CHXCNT register */
#define DMA_CHPADDR(dma,channel)          REG32(((dma) + 0x28U) + 0x18U * (uint32_t)(channel))                                   /*!< DMA channel CHXPADDR register */
#define DMA_CHM0ADDR(dma,channel)         REG32(((dma) + 0x2CU) + 0x18U * (uint32_t)(channel))                                   /*!< DMA channel CHXM0ADDR register */
#define DMA_CHM1ADDR(dma,channel)         REG32(((dma) + 0x30U) + 0x18U * (uint32_t)(channel))                                   /*!< DMA channel CHXM1ADDR register */
#define DMA_CHFCTL(dma,channel)           REG32(((dma) + 0x34U) + 0x18U * (uint32_t)(channel))                                   /*!< DMA channel CHXMADDR register */
#define DMA_CHPCRCDATA(dma,channel)       REG32(((dma) + 0x200U) + 0x04U * (uint32_t)(channel))                                  /*!< DMA channel CHXPCRCDATA register */
#define DMA_CHTOCTL(dma,channel)          REG32(((dma) + 0x300U) + 0x04U * (uint32_t)(channel))                                  /*!< DMA channel CHXTOCTL register */
#define DMA_CHPCADDR(dma,channel)         REG32(((dma) + 0x350U) + 0x04U * (uint32_t)(channel))                                  /*!< DMA channel CHXPCADDR register */
#define DMA_CHMCADDR(dma,channel)         REG32(((dma) + 0x390U) + 0x04U * (uint32_t)(channel))                                  /*!< DMA channel CHXMCADDR register */

/* DMAMUX_RM_CHxCFG base address */
#define DMAMUX_RM_CHXCFG_BASE             (DMAMUX)                                                                     /*!< the base address of DMAMUX request multiplexer channel CHxCFG register */

