sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.h
/* DMA periph address circular mod */
#define DMA_PERIPH_ADDR_CIRCULAR_ENABLE    ((uint32_t)0x00000000U)                                                     /*!< periph address circular mode enable */
#define DMA_PERIPH_ADDR_CIRCULAR_DISABLE   ((uint32_t)0x00000001U)                                                     /*!< periph address circular mode disable */

/* DMA memory address circular mod */
#define DMA_MEMORY_ADDR_CIRCULAR_ENABLE    ((uint32_t)0x00000000U)                                                     /*!< memory address circular mode enable */
#define DMA_MEMORY_ADDR_CIRCULAR_DISABLE   ((uint32_t)0x00000001U)                                                     /*!< memory address circular mode disable */

/* DMA flow controller select */
#define DMA_FLOW_CONTROLLER_DMA           ((uint32_t)0x00000000U)                                                      /*!< DMA is the flow controler */
#define DMA_FLOW_CONTROLLER_PERI          ((uint32_t)0x00000001U)                                                      /*!< peripheral is the flow controler */

/* peripheral increasing mode */
#define DMA_PERIPH_INCREASE_ENABLE        ((uint32_t)0x00000000U)                                                      /*!< next address of peripheral is increasing address mode */
#define DMA_PERIPH_INCREASE_DISABLE       ((uint32_t)0x00000001U)                                                      /*!< next address of peripheral is fixed address mode */
#define DMA_PERIPH_INCREASE_FIX           ((uint32_t)0x00000002U)                                                      /*!< next address of peripheral is increasing fixed */

/* memory increasing mode */
#define DMA_MEMORY_INCREASE_ENABLE        ((uint32_t)0x00000000U)                                                      /*!< next address of memory is increasing address mode */
#define DMA_MEMORY_INCREASE_DISABLE       ((uint32_t)0x00000001U)                                                      /*!< next address of memory is fixed address mode */

/* FIFO status */
#define DMA_FIFO_STATUS_NODATA            ((uint32_t)0x00000000U)                                                      /*!< the data in the FIFO less than 2 word */
#define DMA_FIFO_STATUS_2_WORD            ((uint32_t)0x00000001U)                                                      /*!< the data in the FIFO more than 2 word, less than 4 words */
#define DMA_FIFO_STATUS_4_WORD            ((uint32_t)0x00000002U)                                                      /*!< the data in the FIFO more than 4 word, less than 6 words */
#define DMA_FIFO_STATUS_6_WORD            ((uint32_t)0x00000003U)                                                      /*!< the data in the FIFO more than 6 word, less than 8 words */
#define DMA_FIFO_STATUS_EMPTY             ((uint32_t)0x00000004U)                                                      /*!< the data in the FIFO is empty */
#define DMA_FIFO_STATUS_FULL              ((uint32_t)0x00000005U)                                                      /*!< the data in the FIFO is full */

/* DMA reset value */
#define DMA_CHCTL_RESET_VALUE             ((uint32_t)0x06000000U)                                                      /*!< the reset value of DMA channel CHXCTL register */
#define DMA_CHCNT_RESET_VALUE             ((uint32_t)0x00000000U)                                                      /*!< the reset value of DMA channel CHXCNT register */
#define DMA_CHPADDR_RESET_VALUE           ((uint32_t)0x00000000U)                                                      /*!< the reset value of DMA channel CHXPADDR register */
#define DMA_CHMADDR_RESET_VALUE           ((uint32_t)0x00000000U)                                                      /*!< the reset value of DMA channel CHXMADDR register */
#define DMA_CHINTF_RESET_VALUE            ((uint32_t)0x0000003DU)                                                      /*!< clear DMA channel CHXINTFS register */
#define DMA_CHFCTL_RESET_VALUE            ((uint32_t)0x00000021U)                                                      /*!< the reset value of DMA channel CHXFCTL register */
#define DMA_CHPCRCDATA_RESET_VALUE        ((uint32_t)0xFFFFFFFFU)                                                      /*!< the reset value of DMA channel CHXPCRCDATA register */
#define DMA_CHTOCTL_RESET_VALUE           ((uint32_t)0x00000000U)                                                      /*!< the reset value of DMA channel CHXTOCTL register */
#define DMA_CHPCADDR_RESET_VALUE          ((uint32_t)0x00000000U)                                                      /*!< the reset value of DMA channel CHXPCADDR register */
#define DMA_CHMCADDR_RESET_VALUE          ((uint32_t)0x00000000U)                                                      /*!< the reset value of DMA channel CHXMCADDR register */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMA_TOINTF_RESET_VALUE            ((uint32_t)0x0000FFFFU)                                                      /*!< the reset value of timeout interrupt flag register */
#define DMA_TOINTEN_RESET_VALUE           ((uint32_t)0x00000000U)                                                      /*!< the reset value of timeout interrupt enable register */
#define DMA_TFINTF_RESET_VALUE            ((uint32_t)0x0000FFFFU)                                                      /*!< the reset value of TMR fault interrupt flag register */
#define DMA_TFINTEN_RESET_VALUE           ((uint32_t)0x00000000U)                                                      /*!< the reset value of TMR fault interrupt enable register */
#else
#define DMA_TOINTF_RESET_VALUE            ((uint32_t)0x000000FFU)                                                      /*!< the reset value of timeout interrupt flag register */
#define DMA_TOINTEN_RESET_VALUE           ((uint32_t)0x00000000U)                                                      /*!< the reset value of timeout interrupt enable register */
#define DMA_TFINTF_RESET_VALUE            ((uint32_t)0x000000FFU)                                                      /*!< the reset value of TMR fault interrupt flag register */
#define DMA_TFINTEN_RESET_VALUE           ((uint32_t)0x00000000U)                                                      /*!< the reset value of TMR fault interrupt enable register */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* DMA_INTF register */
/* interrupt flag bits */
#define DMA_INT_FLAG_FEE                  DMA_INTF_FEEIF                                                               /*!< FIFO error and exception flag */
#define DMA_INT_FLAG_SDE                  DMA_INTF_SDEIF                                                               /*!< single data mode exception flag */
#define DMA_INT_FLAG_TAE                  DMA_INTF_TAEIF                                                               /*!< transfer access error flag */
#define DMA_INT_FLAG_HTF                  DMA_INTF_HTFIF                                                               /*!< half transfer finish flag */
#define DMA_INT_FLAG_FTF                  DMA_INTF_FTFIF                                                               /*!< full transfer finish flag */
#define DMA_INT_FLAG_TIMEOUT              BIT(30)                                                                      /*!< transfer timeout flag */
#define DMA_INT_FLAG_TMR_FAULT            BIT(31)                                                                      /*!< control register TMR fault flag */

/* flag bits */
#define DMA_FLAG_FEE                      DMA_INTF_FEEIF                                                               /*!< FIFO error and exception flag */
#define DMA_FLAG_SDE                      DMA_INTF_SDEIF                                                               /*!< single data mode exception flag */
#define DMA_FLAG_TAE                      DMA_INTF_TAEIF                                                               /*!< transfer access error flag */
#define DMA_FLAG_HTF                      DMA_INTF_HTFIF                                                               /*!< half transfer finish flag */
#define DMA_FLAG_FTF                      DMA_INTF_FTFIF                                                               /*!< full transfer finish flag */
#define DMA_FLAG_TIMEOUT                  BIT(30)                                                                      /*!< transfer timeout flag */
#define DMA_FLAG_TMR_FAULT                BIT(31)                                                                      /*!< control register TMR fault flag */

