sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.h
/*timeout interrupt bits*/
#define DMA_TOINTEN_TOIE                  BIT(30)                                                                      /*!< transfer timeout interrupt enable */
#define DMA_TFINTEN_TFIE                  BIT(31)                                                                      /*!< control register TMR fault interrupt enable */

/* DMA interrupt */
#define DMA_INT_SDE                       DMA_CHXCTL_SDEIE                                                             /*!< single data mode exception interrupt */
#define DMA_INT_TAE                       DMA_CHXCTL_TAEIE                                                             /*!< tranfer access error interrupt */
#define DMA_INT_HTF                       DMA_CHXCTL_HTFIE                                                             /*!< half transfer finish interrupt */
#define DMA_INT_FTF                       DMA_CHXCTL_FTFIE                                                             /*!< full transfer finish interrupt */
#define DMA_INT_FEE                       DMA_CHXFCTL_FEEIE                                                            /*!< FIFO exception interrupt */
#define DMA_INT_TIMEOUT                   DMA_TOINTEN_TOIE                                                             /*!< transfer timeout interrupt */
#define DMA_INT_TMR                       DMA_TFINTEN_TFIE                                                             /*!< TMR fault interrupt */

/* DMAMUX request multiplexer channel input identification */
#define RM_CHXCFG_MUXID(regval)           (BITS(0,7) & ((uint32_t)(regval) << 0U))                                     /*!< multiplexer input identification */
#define DMA_REQUEST_M2M                   RM_CHXCFG_MUXID(0U)                                                          /*!< memory to memory transfer */
#define DMA_REQUEST_GENERATOR0            RM_CHXCFG_MUXID(1U)                                                          /*!< DMAMUX request generator 0 */
#define DMA_REQUEST_GENERATOR1            RM_CHXCFG_MUXID(2U)                                                          /*!< DMAMUX request generator 1 */
#define DMA_REQUEST_GENERATOR2            RM_CHXCFG_MUXID(3U)                                                          /*!< DMAMUX request generator 2 */
#define DMA_REQUEST_GENERATOR3            RM_CHXCFG_MUXID(4U)                                                          /*!< DMAMUX request generator 3 */
#define DMA_REQUEST_GENERATOR4            RM_CHXCFG_MUXID(5U)                                                          /*!< DMAMUX request generator 4 */
#define DMA_REQUEST_GENERATOR5            RM_CHXCFG_MUXID(6U)                                                          /*!< DMAMUX request generator 5 */
#define DMA_REQUEST_GENERATOR6            RM_CHXCFG_MUXID(7U)                                                          /*!< DMAMUX request generator 6 */
#define DMA_REQUEST_GENERATOR7            RM_CHXCFG_MUXID(8U)                                                          /*!< DMAMUX request generator 7 */
#define DMA_REQUEST_DAC0                  RM_CHXCFG_MUXID(12U)                                                         /*!< DMAMUX DAC0 request */
#define DMA_REQUEST_DAC1                  RM_CHXCFG_MUXID(13U)                                                         /*!< DMAMUX DAC1 request */
#define DMA_REQUEST_TIMER5_UP0            RM_CHXCFG_MUXID(14U)                                                         /*!< DMAMUX TIMER5 UP0 request */
#define DMA_REQUEST_TIMER6_UP0            RM_CHXCFG_MUXID(15U)                                                         /*!< DMAMUX TIMER6 UP0 request */
#define DMA_REQUEST_SPI0_RX               RM_CHXCFG_MUXID(16U)                                                         /*!< DMAMUX SPI0 RX request */
#define DMA_REQUEST_SPI0_TX               RM_CHXCFG_MUXID(17U)                                                         /*!< DMAMUX SPI0 TX request */
#define DMA_REQUEST_SPI1_RX               RM_CHXCFG_MUXID(18U)                                                         /*!< DMAMUX SPI1 RX request */
#define DMA_REQUEST_SPI1_TX               RM_CHXCFG_MUXID(19U)                                                         /*!< DMAMUX SPI1 TX request */
#define DMA_REQUEST_SPI2_RX               RM_CHXCFG_MUXID(20U)                                                         /*!< DMAMUX SPI2 RX request */
#define DMA_REQUEST_SPI2_TX               RM_CHXCFG_MUXID(21U)                                                         /*!< DMAMUX SPI2 TX request */
#define DMA_REQUEST_SPI3_RX               RM_CHXCFG_MUXID(22U)                                                         /*!< DMAMUX SPI3 RX request */
#define DMA_REQUEST_SPI3_TX               RM_CHXCFG_MUXID(23U)                                                         /*!< DMAMUX SPI3 TX request */
#define DMA_REQUEST_SPI4_I2S_RX           RM_CHXCFG_MUXID(24U)                                                         /*!< DMAMUX SPI4 I2S RX request */
#define DMA_REQUEST_SPI4_I2S_TX           RM_CHXCFG_MUXID(25U)                                                         /*!< DMAMUX SPI4 I2S TX request */
#define DMA_REQUEST_SPI5_I2S_RX           RM_CHXCFG_MUXID(26U)                                                         /*!< DMAMUX SPI5 I2S RX request */
#define DMA_REQUEST_SPI5_I2S_TX           RM_CHXCFG_MUXID(27U)                                                         /*!< DMAMUX SPI5 I2S TX request */
#define DMA_REQUEST_I2C0_RX               RM_CHXCFG_MUXID(28U)                                                         /*!< DMAMUX I2C0 RX request */
#define DMA_REQUEST_I2C0_TX               RM_CHXCFG_MUXID(29U)                                                         /*!< DMAMUX I2C0 TX request */
#define DMA_REQUEST_I2C1_RX               RM_CHXCFG_MUXID(30U)                                                         /*!< DMAMUX I2C1 RX request */
#define DMA_REQUEST_I2C1_TX               RM_CHXCFG_MUXID(31U)                                                         /*!< DMAMUX I2C1 TX request */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMA_REQUEST_SPI6_I2S_RX           RM_CHXCFG_MUXID(32U)                                                         /*!< DMAMUX SPI6 I2S RX request */
#define DMA_REQUEST_SPI6_I2S_TX           RM_CHXCFG_MUXID(33U)                                                         /*!< DMAMUX SPI6 I2S TX request */
#define DMA_REQUEST_SPI7_I2S_RX           RM_CHXCFG_MUXID(34U)                                                         /*!< DMAMUX SPI7 I2S RX request */
#define DMA_REQUEST_SPI7_I2S_TX           RM_CHXCFG_MUXID(35U)                                                         /*!< DMAMUX SPI7 I2S TX request */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define DMA_REQUEST_LINFLEXD0_RX          RM_CHXCFG_MUXID(48U)                                                         /*!< DMAMUX LINFLEXD0 RX request */
#define DMA_REQUEST_LINFLEXD0_TX          RM_CHXCFG_MUXID(49U)                                                         /*!< DMAMUX LINFLEXD0 TX request */
#define DMA_REQUEST_LINFLEXD1_RX          RM_CHXCFG_MUXID(50U)                                                         /*!< DMAMUX LINFLEXD1 RX request */
#define DMA_REQUEST_LINFLEXD1_TX          RM_CHXCFG_MUXID(51U)                                                         /*!< DMAMUX LINFLEXD1 TX request */
#define DMA_REQUEST_LINFLEXD2_RX          RM_CHXCFG_MUXID(52U)                                                         /*!< DMAMUX LINFLEXD2 RX request */
#define DMA_REQUEST_LINFLEXD2_TX          RM_CHXCFG_MUXID(53U)                                                         /*!< DMAMUX LINFLEXD2 TX request */
#define DMA_REQUEST_LINFLEXD3_RX          RM_CHXCFG_MUXID(54U)                                                         /*!< DMAMUX LINFLEXD3 RX request */
#define DMA_REQUEST_LINFLEXD3_TX          RM_CHXCFG_MUXID(55U)                                                         /*!< DMAMUX LINFLEXD3 TX request */
#define DMA_REQUEST_LINFLEXD4_RX          RM_CHXCFG_MUXID(56U)                                                         /*!< DMAMUX LINFLEXD4 RX request */
#define DMA_REQUEST_LINFLEXD4_TX          RM_CHXCFG_MUXID(57U)                                                         /*!< DMAMUX LINFLEXD4 TX request */
#define DMA_REQUEST_LINFLEXD5_RX          RM_CHXCFG_MUXID(58U)                                                         /*!< DMAMUX LINFLEXD5 RX request */
#define DMA_REQUEST_LINFLEXD5_TX          RM_CHXCFG_MUXID(59U)                                                         /*!< DMAMUX LINFLEXD5 TX request */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMA_REQUEST_LINFLEXD6_RX          RM_CHXCFG_MUXID(60U)                                                         /*!< DMAMUX LINFLEXD6 RX request */
#define DMA_REQUEST_LINFLEXD6_TX          RM_CHXCFG_MUXID(61U)                                                         /*!< DMAMUX LINFLEXD6 TX request */
#define DMA_REQUEST_LINFLEXD7_RX          RM_CHXCFG_MUXID(62U)                                                         /*!< DMAMUX LINFLEXD7 RX request */
#define DMA_REQUEST_LINFLEXD7_TX          RM_CHXCFG_MUXID(63U)                                                         /*!< DMAMUX LINFLEXD7 TX request */
#define DMA_REQUEST_LINFLEXD8_RX          RM_CHXCFG_MUXID(64U)                                                         /*!< DMAMUX LINFLEXD8 RX request */
#define DMA_REQUEST_LINFLEXD8_TX          RM_CHXCFG_MUXID(65U)                                                         /*!< DMAMUX LINFLEXD8 TX request */
#define DMA_REQUEST_LINFLEXD9_RX          RM_CHXCFG_MUXID(66U)                                                         /*!< DMAMUX LINFLEXD9 RX request */
#define DMA_REQUEST_LINFLEXD9_TX          RM_CHXCFG_MUXID(67U)                                                         /*!< DMAMUX LINFLEXD9 TX request */
#define DMA_REQUEST_LINFLEXD10_RX         RM_CHXCFG_MUXID(68U)                                                         /*!< DMAMUX LINFLEXD10 RX request */
#define DMA_REQUEST_LINFLEXD10_TX         RM_CHXCFG_MUXID(69U)                                                         /*!< DMAMUX LINFLEXD10 TX request */
#define DMA_REQUEST_LINFLEXD11_RX         RM_CHXCFG_MUXID(70U)                                                         /*!< DMAMUX LINFLEXD11 RX request */
#define DMA_REQUEST_LINFLEXD11_TX         RM_CHXCFG_MUXID(71U)                                                         /*!< DMAMUX LINFLEXD11 TX request */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define DMA_REQUEST_TIMER0_CH0            RM_CHXCFG_MUXID(72U)                                                         /*!< DMAMUX TIMER0 CH0 request */
#define DMA_REQUEST_TIMER0_CH1            RM_CHXCFG_MUXID(73U)                                                         /*!< DMAMUX TIMER0 CH1 request */
#define DMA_REQUEST_TIMER0_CH2            RM_CHXCFG_MUXID(74U)                                                         /*!< DMAMUX TIMER0 CH2 request */
#define DMA_REQUEST_TIMER0_CH3            RM_CHXCFG_MUXID(75U)                                                         /*!< DMAMUX TIMER0 CH3 request */
#define DMA_REQUEST_TIMER0_CH0N           RM_CHXCFG_MUXID(76U)                                                         /*!< DMAMUX TIMER0 CH0N request */
#define DMA_REQUEST_TIMER0_CH1N           RM_CHXCFG_MUXID(77U)                                                         /*!< DMAMUX TIMER0 CH1N request */
#define DMA_REQUEST_TIMER0_CH2N           RM_CHXCFG_MUXID(78U)                                                         /*!< DMAMUX TIMER0 CH2N request */
#define DMA_REQUEST_TIMER0_CH3N           RM_CHXCFG_MUXID(79U)                                                         /*!< DMAMUX TIMER0 CH3N request */
#define DMA_REQUEST_TIMER0_UP             RM_CHXCFG_MUXID(80U)                                                         /*!< DMAMUX TIMER0 UP request */
#define DMA_REQUEST_TIMER0_TRG            RM_CHXCFG_MUXID(81U)                                                         /*!< DMAMUX TIMER0 TRG request */
#define DMA_REQUEST_TIMER0_CMT            RM_CHXCFG_MUXID(82U)                                                         /*!< DMAMUX TIMER0 CMT request */
#define DMA_REQUEST_TIMER7_CH0            RM_CHXCFG_MUXID(83U)                                                         /*!< DMAMUX TIMER7 CH0 request */
#define DMA_REQUEST_TIMER7_CH1            RM_CHXCFG_MUXID(84U)                                                         /*!< DMAMUX TIMER7 CH1 request */
#define DMA_REQUEST_TIMER7_CH2            RM_CHXCFG_MUXID(85U)                                                         /*!< DMAMUX TIMER7 CH2 request */
#define DMA_REQUEST_TIMER7_CH3            RM_CHXCFG_MUXID(86U)                                                         /*!< DMAMUX TIMER7 CH3 request */
#define DMA_REQUEST_TIMER7_CH0N           RM_CHXCFG_MUXID(87U)                                                         /*!< DMAMUX TIMER7 CH0N request */
#define DMA_REQUEST_TIMER7_CH1N           RM_CHXCFG_MUXID(88U)                                                         /*!< DMAMUX TIMER7 CH1N request */
#define DMA_REQUEST_TIMER7_CH2N           RM_CHXCFG_MUXID(89U)                                                         /*!< DMAMUX TIMER7 CH2N request */
#define DMA_REQUEST_TIMER7_CH3N           RM_CHXCFG_MUXID(90U)                                                         /*!< DMAMUX TIMER7 CH3N request */
#define DMA_REQUEST_TIMER7_UP             RM_CHXCFG_MUXID(91U)                                                         /*!< DMAMUX TIMER7 UP request */
#define DMA_REQUEST_TIMER7_TRG            RM_CHXCFG_MUXID(92U)                                                         /*!< DMAMUX TIMER7 TRG request */
#define DMA_REQUEST_TIMER7_CMT            RM_CHXCFG_MUXID(93U)                                                         /*!< DMAMUX TIMER7 CMT request */
#define DMA_REQUEST_TIMER19_CH0           RM_CHXCFG_MUXID(94U)                                                         /*!< DMAMUX TIMER19 CH0 request */
#define DMA_REQUEST_TIMER19_CH1           RM_CHXCFG_MUXID(95U)                                                         /*!< DMAMUX TIMER19 CH1 request */
#define DMA_REQUEST_TIMER19_CH2           RM_CHXCFG_MUXID(96U)                                                         /*!< DMAMUX TIMER19 CH2 request */
#define DMA_REQUEST_TIMER19_CH3           RM_CHXCFG_MUXID(97U)                                                         /*!< DMAMUX TIMER19 CH3 request */
#define DMA_REQUEST_TIMER19_CH0N          RM_CHXCFG_MUXID(98U)                                                         /*!< DMAMUX TIMER19 CH0N request */
#define DMA_REQUEST_TIMER19_CH1N          RM_CHXCFG_MUXID(99U)                                                         /*!< DMAMUX TIMER19 CH1N request */
#define DMA_REQUEST_TIMER19_CH2N          RM_CHXCFG_MUXID(100U)                                                        /*!< DMAMUX TIMER19 CH2N request */
#define DMA_REQUEST_TIMER19_CH3N          RM_CHXCFG_MUXID(101U)                                                        /*!< DMAMUX TIMER19 CH3N request */
#define DMA_REQUEST_TIMER19_UP            RM_CHXCFG_MUXID(102U)                                                        /*!< DMAMUX TIMER19 UP request */
#define DMA_REQUEST_TIMER19_TRG           RM_CHXCFG_MUXID(103U)                                                        /*!< DMAMUX TIMER19 TRG request */
#define DMA_REQUEST_TIMER19_CMT           RM_CHXCFG_MUXID(104U)                                                        /*!< DMAMUX TIMER19 CMT request */
#define DMA_REQUEST_TIMER20_CH0           RM_CHXCFG_MUXID(105U)                                                        /*!< DMAMUX TIMER20 CH0 request */
#define DMA_REQUEST_TIMER20_CH1           RM_CHXCFG_MUXID(106U)                                                        /*!< DMAMUX TIMER20 CH1 request */
#define DMA_REQUEST_TIMER20_CH2           RM_CHXCFG_MUXID(107U)                                                        /*!< DMAMUX TIMER20 CH2 request */
#define DMA_REQUEST_TIMER20_CH3           RM_CHXCFG_MUXID(108U)                                                        /*!< DMAMUX TIMER20 CH3 request */
#define DMA_REQUEST_TIMER20_CH0N          RM_CHXCFG_MUXID(109U)                                                        /*!< DMAMUX TIMER20 CH0N request */
#define DMA_REQUEST_TIMER20_CH1N          RM_CHXCFG_MUXID(110U)                                                        /*!< DMAMUX TIMER20 CH1N request */
#define DMA_REQUEST_TIMER20_CH2N          RM_CHXCFG_MUXID(111U)                                                        /*!< DMAMUX TIMER20 CH2N request */
#define DMA_REQUEST_TIMER20_CH3N          RM_CHXCFG_MUXID(112U)                                                        /*!< DMAMUX TIMER20 CH3N request */
#define DMA_REQUEST_TIMER20_UP            RM_CHXCFG_MUXID(113U)                                                        /*!< DMAMUX TIMER20 UP request */
#define DMA_REQUEST_TIMER20_TRG           RM_CHXCFG_MUXID(114U)                                                        /*!< DMAMUX TIMER20 TRG request */
#define DMA_REQUEST_TIMER20_CMT           RM_CHXCFG_MUXID(115U)                                                        /*!< DMAMUX TIMER20 CMT request */
#define DMA_REQUEST_TIMER60_CH0           RM_CHXCFG_MUXID(116U)                                                        /*!< DMAMUX TIMER60 CH0 request */
#define DMA_REQUEST_TIMER60_CH1           RM_CHXCFG_MUXID(117U)                                                        /*!< DMAMUX TIMER60 CH1 request */
#define DMA_REQUEST_TIMER60_CH2           RM_CHXCFG_MUXID(118U)                                                        /*!< DMAMUX TIMER60 CH2 request */
#define DMA_REQUEST_TIMER60_CH3           RM_CHXCFG_MUXID(119U)                                                        /*!< DMAMUX TIMER60 CH3 request */
#define DMA_REQUEST_TIMER60_CH0N          RM_CHXCFG_MUXID(120U)                                                        /*!< DMAMUX TIMER60 CH0N request */
#define DMA_REQUEST_TIMER60_CH1N          RM_CHXCFG_MUXID(121U)                                                        /*!< DMAMUX TIMER60 CH1N request */
#define DMA_REQUEST_TIMER60_CH2N          RM_CHXCFG_MUXID(122U)                                                        /*!< DMAMUX TIMER60 CH2N request */
#define DMA_REQUEST_TIMER60_CH3N          RM_CHXCFG_MUXID(123U)                                                        /*!< DMAMUX TIMER60 CH3N request */
#define DMA_REQUEST_TIMER60_UP            RM_CHXCFG_MUXID(124U)                                                        /*!< DMAMUX TIMER60 UP request */
#define DMA_REQUEST_TIMER60_TRG           RM_CHXCFG_MUXID(125U)                                                        /*!< DMAMUX TIMER60 TRG request */
#define DMA_REQUEST_TIMER60_CMT           RM_CHXCFG_MUXID(126U)                                                        /*!< DMAMUX TIMER60 CMT request */
#define DMA_REQUEST_TIMER61_CH0           RM_CHXCFG_MUXID(127U)                                                        /*!< DMAMUX TIMER61 CH0 request */
#define DMA_REQUEST_TIMER61_CH1           RM_CHXCFG_MUXID(128U)                                                        /*!< DMAMUX TIMER61 CH1 request */
#define DMA_REQUEST_TIMER61_CH2           RM_CHXCFG_MUXID(129U)                                                        /*!< DMAMUX TIMER61 CH2 request */
#define DMA_REQUEST_TIMER61_CH3           RM_CHXCFG_MUXID(130U)                                                        /*!< DMAMUX TIMER61 CH3 request */
#define DMA_REQUEST_TIMER61_CH0N          RM_CHXCFG_MUXID(131U)                                                        /*!< DMAMUX TIMER61 CH0N request */
#define DMA_REQUEST_TIMER61_CH1N          RM_CHXCFG_MUXID(132U)                                                        /*!< DMAMUX TIMER61 CH1N request */
#define DMA_REQUEST_TIMER61_CH2N          RM_CHXCFG_MUXID(133U)                                                        /*!< DMAMUX TIMER61 CH2N request */
#define DMA_REQUEST_TIMER61_CH3N          RM_CHXCFG_MUXID(134U)                                                        /*!< DMAMUX TIMER61 CH3N request */
#define DMA_REQUEST_TIMER61_UP            RM_CHXCFG_MUXID(135U)                                                        /*!< DMAMUX TIMER61 UP request */
#define DMA_REQUEST_TIMER61_TRG           RM_CHXCFG_MUXID(136U)                                                        /*!< DMAMUX TIMER61 TRG request */
#define DMA_REQUEST_TIMER61_CMT           RM_CHXCFG_MUXID(137U)                                                        /*!< DMAMUX TIMER61 CMT request */
#define DMA_REQUEST_TIMER62_CH0           RM_CHXCFG_MUXID(138U)                                                        /*!< DMAMUX TIMER62 CH0 request */
#define DMA_REQUEST_TIMER62_CH1           RM_CHXCFG_MUXID(139U)                                                        /*!< DMAMUX TIMER62 CH1 request */
#define DMA_REQUEST_TIMER62_CH2           RM_CHXCFG_MUXID(140U)                                                        /*!< DMAMUX TIMER62 CH2 request */
#define DMA_REQUEST_TIMER62_CH3           RM_CHXCFG_MUXID(141U)                                                        /*!< DMAMUX TIMER62 CH3 request */
#define DMA_REQUEST_TIMER62_CH0N          RM_CHXCFG_MUXID(142U)                                                        /*!< DMAMUX TIMER62 CH0N request */
#define DMA_REQUEST_TIMER62_CH1N          RM_CHXCFG_MUXID(143U)                                                        /*!< DMAMUX TIMER62 CH1N request */
#define DMA_REQUEST_TIMER62_CH2N          RM_CHXCFG_MUXID(144U)                                                        /*!< DMAMUX TIMER62 CH2N request */
#define DMA_REQUEST_TIMER62_CH3N          RM_CHXCFG_MUXID(145U)                                                        /*!< DMAMUX TIMER62 CH3N request */
#define DMA_REQUEST_TIMER62_UP            RM_CHXCFG_MUXID(146U)                                                        /*!< DMAMUX TIMER62 UP request */
#define DMA_REQUEST_TIMER62_TRG           RM_CHXCFG_MUXID(147U)                                                        /*!< DMAMUX TIMER62 TRG request */
#define DMA_REQUEST_TIMER62_CMT           RM_CHXCFG_MUXID(148U)                                                        /*!< DMAMUX TIMER62 CMT request */
#define DMA_REQUEST_TIMER63_CH0           RM_CHXCFG_MUXID(149U)                                                        /*!< DMAMUX TIMER63 CH0 request */
#define DMA_REQUEST_TIMER63_CH1           RM_CHXCFG_MUXID(150U)                                                        /*!< DMAMUX TIMER63 CH1 request */
#define DMA_REQUEST_TIMER63_CH2           RM_CHXCFG_MUXID(151U)                                                        /*!< DMAMUX TIMER63 CH2 request */
#define DMA_REQUEST_TIMER63_CH3           RM_CHXCFG_MUXID(152U)                                                        /*!< DMAMUX TIMER63 CH3 request */
#define DMA_REQUEST_TIMER63_CH0N          RM_CHXCFG_MUXID(153U)                                                        /*!< DMAMUX TIMER63 CH0N request */
#define DMA_REQUEST_TIMER63_CH1N          RM_CHXCFG_MUXID(154U)                                                        /*!< DMAMUX TIMER63 CH1N request */
#define DMA_REQUEST_TIMER63_CH2N          RM_CHXCFG_MUXID(155U)                                                        /*!< DMAMUX TIMER63 CH2N request */
#define DMA_REQUEST_TIMER63_CH3N          RM_CHXCFG_MUXID(156U)                                                        /*!< DMAMUX TIMER63 CH3N request */
#define DMA_REQUEST_TIMER63_UP            RM_CHXCFG_MUXID(157U)                                                        /*!< DMAMUX TIMER63 UP request */
