sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.h
#define DMA_REQUEST_TIMER63_TRG           RM_CHXCFG_MUXID(158U)                                                        /*!< DMAMUX TIMER63 TRG request */
#define DMA_REQUEST_TIMER63_CMT           RM_CHXCFG_MUXID(159U)                                                        /*!< DMAMUX TIMER63 CMT request */
#define DMA_REQUEST_TIMER1_CH0            RM_CHXCFG_MUXID(160U)                                                        /*!< DMAMUX TIMER1 CH0 request */
#define DMA_REQUEST_TIMER1_CH1            RM_CHXCFG_MUXID(161U)                                                        /*!< DMAMUX TIMER1 CH1 request */
#define DMA_REQUEST_TIMER1_CH2            RM_CHXCFG_MUXID(162U)                                                        /*!< DMAMUX TIMER1 CH2 request */
#define DMA_REQUEST_TIMER1_CH3            RM_CHXCFG_MUXID(163U)                                                        /*!< DMAMUX TIMER1 CH3 request */
#define DMA_REQUEST_TIMER1_UP             RM_CHXCFG_MUXID(164U)                                                        /*!< DMAMUX TIMER1 UP request */
#define DMA_REQUEST_TIMER1_TRG            RM_CHXCFG_MUXID(165U)                                                        /*!< DMAMUX TIMER1 TRG request */
#define DMA_REQUEST_TIMER2_CH0            RM_CHXCFG_MUXID(166U)                                                        /*!< DMAMUX TIMER2 CH0 request */
#define DMA_REQUEST_TIMER2_CH1            RM_CHXCFG_MUXID(167U)                                                        /*!< DMAMUX TIMER2 CH1 request */
#define DMA_REQUEST_TIMER2_CH2            RM_CHXCFG_MUXID(168U)                                                        /*!< DMAMUX TIMER2 CH2 request */
#define DMA_REQUEST_TIMER2_CH3            RM_CHXCFG_MUXID(169U)                                                        /*!< DMAMUX TIMER2 CH3 request */
#define DMA_REQUEST_TIMER2_UP             RM_CHXCFG_MUXID(170U)                                                        /*!< DMAMUX TIMER2 UP request */
#define DMA_REQUEST_TIMER2_TRG            RM_CHXCFG_MUXID(171U)                                                        /*!< DMAMUX TIMER2 TRG request */
#define DMA_REQUEST_QSPI                  RM_CHXCFG_MUXID(172U)                                                        /*!< DMAMUX QSPI request */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMA_REQUEST_MFCOM_SSTAT0          RM_CHXCFG_MUXID(173U)                                                        /*!< DMAMUX MFCOM SSTAT0 request */
#define DMA_REQUEST_MFCOM_SSTAT1          RM_CHXCFG_MUXID(174U)                                                        /*!< DMAMUX MFCOM SSTAT1 request */
#define DMA_REQUEST_MFCOM_SSTAT2          RM_CHXCFG_MUXID(175U)                                                        /*!< DMAMUX MFCOM SSTAT2 request */
#define DMA_REQUEST_MFCOM_SSTAT3          RM_CHXCFG_MUXID(176U)                                                        /*!< DMAMUX MFCOM SSTAT3 request */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define DMA_REQUEST_DTM_CAN0_RX0          RM_CHXCFG_MUXID(177U)                                                        /*!< DMAMUX DTM_CAN0_RX0 request */
#define DMA_REQUEST_DTM_CAN0_RX1          RM_CHXCFG_MUXID(178U)                                                        /*!< DMAMUX DTM_CAN0_RX1 request */
#define DMA_REQUEST_DTM_CAN0_TX           RM_CHXCFG_MUXID(179U)                                                        /*!< DMAMUX DTM_CAN0_TX request */
#define DMA_REQUEST_DTM_CAN0_TXE          RM_CHXCFG_MUXID(180U)                                                        /*!< DMAMUX DTM_CAN0_TXE request */
#define DMA_REQUEST_DTM_CAN1_RX0          RM_CHXCFG_MUXID(181U)                                                        /*!< DMAMUX DTM_CAN1_RX0 request */
#define DMA_REQUEST_DTM_CAN1_RX1          RM_CHXCFG_MUXID(182U)                                                        /*!< DMAMUX DTM_CAN1_RX1 request */
#define DMA_REQUEST_DTM_CAN1_TX           RM_CHXCFG_MUXID(183U)                                                        /*!< DMAMUX DTM_CAN1_TX request */
#define DMA_REQUEST_DTM_CAN1_TXE          RM_CHXCFG_MUXID(184U)                                                        /*!< DMAMUX DTM_CAN1_TXE request */
#define DMA_REQUEST_ADC0_ROUTINE          RM_CHXCFG_MUXID(185U)                                                        /*!< DMAMUX ADC0 ROUTINE request */
#define DMA_REQUEST_ADC0_INSERTED0        RM_CHXCFG_MUXID(186U)                                                        /*!< DMAMUX ADC0 INSERTED0 request */
#define DMA_REQUEST_ADC0_INSERTED1        RM_CHXCFG_MUXID(187U)                                                        /*!< DMAMUX ADC0 INSERTED1 request */
#define DMA_REQUEST_ADC0_INSERTED2        RM_CHXCFG_MUXID(188U)                                                        /*!< DMAMUX ADC0 INSERTED2 request */
#define DMA_REQUEST_ADC0_INSERTED3        RM_CHXCFG_MUXID(189U)                                                        /*!< DMAMUX ADC0 INSERTED3 request */
#define DMA_REQUEST_ADC0_INSERTED4        RM_CHXCFG_MUXID(190U)                                                        /*!< DMAMUX ADC0 INSERTED4 request */
#define DMA_REQUEST_ADC0_INSERTED5        RM_CHXCFG_MUXID(191U)                                                        /*!< DMAMUX ADC0 INSERTED5 request */
#define DMA_REQUEST_ADC1_ROUTINE          RM_CHXCFG_MUXID(192U)                                                        /*!< DMAMUX ADC1 ROUTINE request */
#define DMA_REQUEST_ADC1_INSERTED0        RM_CHXCFG_MUXID(193U)                                                        /*!< DMAMUX ADC1 INSERTED0 request */
#define DMA_REQUEST_ADC1_INSERTED1        RM_CHXCFG_MUXID(194U)                                                        /*!< DMAMUX ADC1 INSERTED1 request */
#define DMA_REQUEST_ADC1_INSERTED2        RM_CHXCFG_MUXID(195U)                                                        /*!< DMAMUX ADC1 INSERTED2 request */
#define DMA_REQUEST_ADC1_INSERTED3        RM_CHXCFG_MUXID(196U)                                                        /*!< DMAMUX ADC1 INSERTED3 request */
#define DMA_REQUEST_ADC1_INSERTED4        RM_CHXCFG_MUXID(197U)                                                        /*!< DMAMUX ADC1 INSERTED4 request */
#define DMA_REQUEST_ADC1_INSERTED5        RM_CHXCFG_MUXID(198U)                                                        /*!< DMAMUX ADC1 INSERTED5 request */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMA_REQUEST_ADC2_ROUTINE          RM_CHXCFG_MUXID(199U)                                                        /*!< DMAMUX ADC2 ROUTINE request */
#define DMA_REQUEST_ADC2_INSERTED0        RM_CHXCFG_MUXID(200U)                                                        /*!< DMAMUX ADC2 INSERTED0 request */
#define DMA_REQUEST_ADC2_INSERTED1        RM_CHXCFG_MUXID(201U)                                                        /*!< DMAMUX ADC2INSERTED1 request */
#define DMA_REQUEST_ADC2_INSERTED2        RM_CHXCFG_MUXID(202U)                                                        /*!< DMAMUX ADC2INSERTED2 request */
#define DMA_REQUEST_ADC2_INSERTED3        RM_CHXCFG_MUXID(203U)                                                        /*!< DMAMUX ADC2INSERTED3 request */
#define DMA_REQUEST_ADC2_INSERTED4        RM_CHXCFG_MUXID(204U)                                                        /*!< DMAMUX ADC2INSERTED4 request */
#define DMA_REQUEST_ADC2_INSERTED5        RM_CHXCFG_MUXID(205U)                                                        /*!< DMAMUX ADC2INSERTED5 request */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define DMA_REQUEST_TIMER5_UP1            RM_CHXCFG_MUXID(206U)                                                        /*!< DMAMUX TIMER5 UP1 request */
#define DMA_REQUEST_TIMER5_UP2            RM_CHXCFG_MUXID(207U)                                                        /*!< DMAMUX TIMER5 UP2 request */
#define DMA_REQUEST_TIMER5_UP3            RM_CHXCFG_MUXID(208U)                                                        /*!< DMAMUX TIMER5 UP3 request */
#define DMA_REQUEST_TIMER6_UP1            RM_CHXCFG_MUXID(209U)                                                        /*!< DMAMUX TIMER6 UP1 request */
#define DMA_REQUEST_TIMER6_UP2            RM_CHXCFG_MUXID(210U)                                                        /*!< DMAMUX TIMER6 UP2 request */
#define DMA_REQUEST_TIMER6_UP3            RM_CHXCFG_MUXID(211U)                                                        /*!< DMAMUX TIMER6 UP3 request */
#define DMA_REQUEST_DTM_CAN2_RX0          RM_CHXCFG_MUXID(212U)                                                        /*!< DMAMUX DTM_CAN2_RX0 request */
#define DMA_REQUEST_DTM_CAN2_RX1          RM_CHXCFG_MUXID(213U)                                                        /*!< DMAMUX DTM_CAN2_RX1 request */
#define DMA_REQUEST_DTM_CAN2_TX           RM_CHXCFG_MUXID(214U)                                                        /*!< DMAMUX DTM_CAN2_TX request */
#define DMA_REQUEST_DTM_CAN2_TXE          RM_CHXCFG_MUXID(215U)                                                        /*!< DMAMUX DTM_CAN2_TXE request */
#define DMA_REQUEST_DTM_CAN3_RX0          RM_CHXCFG_MUXID(216U)                                                        /*!< DMAMUX DTM_CAN3_RX0 request */
#define DMA_REQUEST_DTM_CAN3_RX1          RM_CHXCFG_MUXID(217U)                                                        /*!< DMAMUX DTM_CAN3_RX1 request */
#define DMA_REQUEST_DTM_CAN3_TX           RM_CHXCFG_MUXID(218U)                                                        /*!< DMAMUX DTM_CAN3_TX request */
#define DMA_REQUEST_DTM_CAN3_TXE          RM_CHXCFG_MUXID(219U)                                                        /*!< DMAMUX DTM_CAN3_TXE request */
#define DMA_REQUEST_DTM_CAN4_RX0          RM_CHXCFG_MUXID(220U)                                                        /*!< DMAMUX DTM_CAN4_RX0 request */
#define DMA_REQUEST_DTM_CAN4_RX1          RM_CHXCFG_MUXID(221U)                                                        /*!< DMAMUX DTM_CAN4_RX1 request */
#define DMA_REQUEST_DTM_CAN4_TX           RM_CHXCFG_MUXID(222U)                                                        /*!< DMAMUX DTM_CAN4_TX request */
#define DMA_REQUEST_DTM_CAN4_TXE          RM_CHXCFG_MUXID(223U)                                                        /*!< DMAMUX DTM_CAN4_TXE request */
#define DMA_REQUEST_DTM_CAN5_RX0          RM_CHXCFG_MUXID(224U)                                                        /*!< DMAMUX DTM_CAN5_RX0 request */
#define DMA_REQUEST_DTM_CAN5_RX1          RM_CHXCFG_MUXID(225U)                                                        /*!< DMAMUX DTM_CAN5_RX1 request */
#define DMA_REQUEST_DTM_CAN5_TX           RM_CHXCFG_MUXID(226U)                                                        /*!< DMAMUX DTM_CAN5_TX request */
#define DMA_REQUEST_DTM_CAN5_TXE          RM_CHXCFG_MUXID(227U)                                                        /*!< DMAMUX DTM_CAN5_TXE request */
#define DMA_REQUEST_DTM_CAN6_RX0          RM_CHXCFG_MUXID(228U)                                                        /*!< DMAMUX DTM_CAN6_RX0 request */
#define DMA_REQUEST_DTM_CAN6_RX1          RM_CHXCFG_MUXID(229U)                                                        /*!< DMAMUX DTM_CAN6_RX1 request */
#define DMA_REQUEST_DTM_CAN6_TX           RM_CHXCFG_MUXID(230U)                                                        /*!< DMAMUX DTM_CAN6_TX request */
#define DMA_REQUEST_DTM_CAN6_TXE          RM_CHXCFG_MUXID(231U)                                                        /*!< DMAMUX DTM_CAN6_TXE request */
#define DMA_REQUEST_DTM_CAN7_RX0          RM_CHXCFG_MUXID(232U)                                                        /*!< DMAMUX DTM_CAN7_RX0 request */
#define DMA_REQUEST_DTM_CAN7_RX1          RM_CHXCFG_MUXID(233U)                                                        /*!< DMAMUX DTM_CAN7_RX1 request */
#define DMA_REQUEST_DTM_CAN7_TX           RM_CHXCFG_MUXID(234U)                                                        /*!< DMAMUX DTM_CAN7_TX request */
#define DMA_REQUEST_DTM_CAN7_TXE          RM_CHXCFG_MUXID(235U)                                                        /*!< DMAMUX DTM_CAN7_TXE request */

/* DMAMUX request generator trigger input identification */
#define RG_CHXCFG_TID(regval)             (BITS(0,5) & ((uint32_t)(regval) << 0U))                                     /*!< trigger input identification */
#define DMAMUX_TRIGGER_EXTI0              RG_CHXCFG_TID(0U)                                                            /*!< trigger input is EXTI0 */
#define DMAMUX_TRIGGER_EXTI1              RG_CHXCFG_TID(1U)                                                            /*!< trigger input is EXTI1 */
#define DMAMUX_TRIGGER_EXTI2              RG_CHXCFG_TID(2U)                                                            /*!< trigger input is EXTI2 */
#define DMAMUX_TRIGGER_EXTI3              RG_CHXCFG_TID(3U)                                                            /*!< trigger input is EXTI3 */
#define DMAMUX_TRIGGER_EXTI4              RG_CHXCFG_TID(4U)                                                            /*!< trigger input is EXTI4 */
#define DMAMUX_TRIGGER_EXTI5              RG_CHXCFG_TID(5U)                                                            /*!< trigger input is EXTI5 */
#define DMAMUX_TRIGGER_EXTI6              RG_CHXCFG_TID(6U)                                                            /*!< trigger input is EXTI6 */
#define DMAMUX_TRIGGER_EXTI7              RG_CHXCFG_TID(7U)                                                            /*!< trigger input is EXTI7 */
#define DMAMUX_TRIGGER_EXTI8              RG_CHXCFG_TID(8U)                                                            /*!< trigger input is EXTI8 */
#define DMAMUX_TRIGGER_EXTI9              RG_CHXCFG_TID(9U)                                                            /*!< trigger input is EXTI9 */
#define DMAMUX_TRIGGER_EXTI10             RG_CHXCFG_TID(10U)                                                           /*!< trigger input is EXTI10 */
#define DMAMUX_TRIGGER_EXTI11             RG_CHXCFG_TID(11U)                                                           /*!< trigger input is EXTI11 */
#define DMAMUX_TRIGGER_EXTI12             RG_CHXCFG_TID(12U)                                                           /*!< trigger input is EXTI12 */
#define DMAMUX_TRIGGER_EXTI13             RG_CHXCFG_TID(13U)                                                           /*!< trigger input is EXTI13 */
#define DMAMUX_TRIGGER_EXTI14             RG_CHXCFG_TID(14U)                                                           /*!< trigger input is EXTI14 */
#define DMAMUX_TRIGGER_EXTI15             RG_CHXCFG_TID(15U)                                                           /*!< trigger input is EXTI15 */
#define DMAMUX_TRIGGER_EVT0_OUT           RG_CHXCFG_TID(16U)                                                           /*!< trigger input is Evt0_out */
#define DMAMUX_TRIGGER_EVT1_OUT           RG_CHXCFG_TID(17U)                                                           /*!< trigger input is Evt1_out */
#define DMAMUX_TRIGGER_EVT2_OUT           RG_CHXCFG_TID(18U)                                                           /*!< trigger input is Evt2_out */
#define DMAMUX_TRIGGER_EVT3_OUT           RG_CHXCFG_TID(19U)                                                           /*!< trigger input is Evt3_out */
#define DMAMUX_TRIGGER_EVT4_OUT           RG_CHXCFG_TID(20U)                                                           /*!< trigger input is Evt4_out */
#define DMAMUX_TRIGGER_EVT5_OUT           RG_CHXCFG_TID(21U)                                                           /*!< trigger input is Evt5_out */
#define DMAMUX_TRIGGER_EVT6_OUT           RG_CHXCFG_TID(22U)                                                           /*!< trigger input is Evt6_out */
#define DMAMUX_TRIGGER_EVT7_OUT           RG_CHXCFG_TID(23U)                                                           /*!< trigger input is Evt7_out */
#define DMAMUX_TRIGGER_TIMER1_TRGO        RG_CHXCFG_TID(24U)                                                           /*!< trigger input is TIMER1 TRGO */

