sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.h
/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check peripherals */
#define NOT_DMA_PERIPH(periph)                               (((periph) != DMA0) && ((periph) != DMA1))
/* check DMA channel */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMA_CHANNEL_HIGH                                     DMA_CH15
#else
#define DMA_CHANNEL_HIGH                                     DMA_CH7
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define NOT_DMA_CHANNEL(channels)                            (DMA_CHANNEL_HIGH < (channels))

/* check DMA request */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMA_REQUEST_HIGH                                     RM_CHXCFG_MUXID(211U)
#else
#define DMA_REQUEST_HIGH                                     RM_CHXCFG_MUXID(235U)
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define NOT_DMA_REQUEST(request)                             (DMA_REQUEST_HIGH < (request))
/* check DMA periph increase algorithm */
#define NOT_DMA_PERIPH_INCREASE(periph_inc)                  (((periph_inc) != DMA_PERIPH_INCREASE_ENABLE) && ((periph_inc) != DMA_PERIPH_INCREASE_DISABLE) && \
                                                              ((periph_inc) != DMA_PERIPH_INCREASE_FIX))
/* check memory increase algorithm*/
#define NOT_DMA_MEMORY_INCREASE(memory_inc)                  (((memory_inc) != DMA_MEMORY_INCREASE_ENABLE) && ((memory_inc) != DMA_MEMORY_INCREASE_DISABLE))
/* check DMA periph and memory width */
#define NOT_DMA_PERIPH_MEMORY_WIDTH(periph_memory_width)     (((periph_memory_width) != DMA_PERIPH_WIDTH_8BIT) && ((periph_memory_width) != DMA_PERIPH_WIDTH_16BIT) && \
                                                              ((periph_memory_width) != DMA_PERIPH_WIDTH_32BIT) && ((periph_memory_width) != DMA_PERIPH_WIDTH_64BIT))
/* check DMA periph address circular mode */
#define NOT_DMA_PERIPH_ADDR_CIRCULAR(periph_addr_circular)   (((periph_addr_circular) != DMA_PERIPH_ADDR_CIRCULAR_ENABLE) && ((periph_addr_circular) != DMA_PERIPH_ADDR_CIRCULAR_DISABLE))
/* check DMA memory address circular mode */
#define NOT_DMA_MEMORY_ADDR_CIRCULAR(memory_addr_circular)   (((memory_addr_circular) != DMA_MEMORY_ADDR_CIRCULAR_ENABLE) && ((memory_addr_circular) != DMA_MEMORY_ADDR_CIRCULAR_DISABLE))
/* check DMA transfer direction */
#define NOT_DMA_TRANSFER_DIRECTION(direction)                (((direction) != DMA_PERIPH_TO_MEMORY) && ((direction) != DMA_MEMORY_TO_PERIPH) && \
                                                              ((direction) != DMA_MEMORY_TO_MEMORY))
/* check DMA number of remaining data to be transferred */
#define DMA_NUMBER_HIGH                                      (65535U)
#define NOT_DMA_NUMBER(number)                               (DMA_NUMBER_HIGH < (number))
/* check DMA priority */
#define NOT_DMA_PRIORITY(priority)                           (((priority) != DMA_PRIORITY_LOW) && ((priority) != DMA_PRIORITY_MEDIUM) && \
                                                              ((priority) != DMA_PRIORITY_HIGH) && ((priority) != DMA_PRIORITY_ULTRA_HIGH))
/* check DMA periph width */
#define NOT_DMA_PERIPH_WIDTH(periph_width)                   (((periph_width) != DMA_PERIPH_WIDTH_8BIT) && ((periph_width) != DMA_PERIPH_WIDTH_16BIT) && \
                                                              ((periph_width) != DMA_PERIPH_WIDTH_32BIT) && ((periph_width) != DMA_PERIPH_WIDTH_64BIT))
/* check DMA memory width */
#define NOT_DMA_MEMORY_WIDTH(memory_width)                   (((memory_width) != DMA_MEMORY_WIDTH_8BIT)  && ((memory_width) != DMA_MEMORY_WIDTH_16BIT) && \
                                                              ((memory_width) != DMA_MEMORY_WIDTH_32BIT) && ((memory_width) != DMA_MEMORY_WIDTH_64BIT))
/* check DMA memory burst width */
#define NOT_DMA_MEMORY_BURST_WIDTH(memory_burst_width)       (((memory_burst_width) != DMA_MEMORY_BURST_SINGLE)  && ((memory_burst_width) != DMA_MEMORY_BURST_4_BEAT) && \
                                                              ((memory_burst_width) != DMA_MEMORY_BURST_8_BEAT)  && ((memory_burst_width) != DMA_MEMORY_BURST_16_BEAT))
/* check DMA periph burst width */
#define NOT_DMA_PERIPH_BURST_WIDTH(periph_burst_width)       (((periph_burst_width) != DMA_PERIPH_BURST_SINGLE)  && ((periph_burst_width) != DMA_PERIPH_BURST_4_BEAT) && \
                                                              ((periph_burst_width) != DMA_PERIPH_BURST_8_BEAT)  && ((periph_burst_width) != DMA_PERIPH_BURST_16_BEAT))
/* check DMA FIFO critical value */
#define NOT_DMA_FIFO_CRITICAL_VALUE(critical_value)          (((critical_value) != DMA_FIFO_2_WORD) && ((critical_value) != DMA_FIFO_4_WORD) && \
                                                              ((critical_value) != DMA_FIFO_6_WORD) && ((critical_value) != DMA_FIFO_8_WORD))
/* check DMA memory flag */
#define NOT_DMA_MEMORY_FLAG(memory_flag)                     (((memory_flag) != DMA_MEMORY_0)  && ((memory_flag) != DMA_MEMORY_1))
/* check DMA flow controller */
#define NOT_DMA_FLOW_CONTROLLER(controller)                  (((controller) != DMA_FLOW_CONTROLLER_DMA)  && ((controller) != DMA_FLOW_CONTROLLER_PERI))
/* check DMA transfer timeout threshold */
#define DMA_TIMEOUT_THRESHOLD_HIGH                           (0x1FFFFFU)
#define NOT_DMA_TIMEOUT_THRESHOLD(threshold)                 ((DMA_TIMEOUT_THRESHOLD_HIGH < (threshold)))
/* check DMA flag */
#define NOT_DMA_FLAG(flag)                                   (((flag) != DMA_FLAG_FEE) && ((flag) != DMA_FLAG_SDE) && \
                                                              ((flag) != DMA_FLAG_TAE) && ((flag) != DMA_FLAG_HTF) && \
                                                              ((flag) != DMA_FLAG_FTF) && ((flag) != DMA_FLAG_TIMEOUT) && \
                                                              ((flag) != DMA_FLAG_TMR_FAULT))
/* check DMA interrupt flag */
#define NOT_DMA_INTERRUPT_FLAG(interrupt_flag)               (((interrupt_flag) != DMA_INT_FLAG_FEE) && ((interrupt_flag) != DMA_INT_FLAG_SDE) && \
                                                              ((interrupt_flag) != DMA_INT_FLAG_TAE) && ((interrupt_flag) != DMA_INT_FLAG_HTF) && \
                                                              ((interrupt_flag) != DMA_INT_FLAG_FTF) && ((interrupt_flag) != DMA_INT_FLAG_TIMEOUT) && \
                                                              ((interrupt_flag) != DMA_INT_FLAG_TMR_FAULT))
/* check DMA interrupt */
#define NOT_DMA_INTERRUPT(interrupt)                         (((interrupt) != DMA_INT_SDE)  && ((interrupt) != DMA_INT_TAE) && \
                                                              ((interrupt) != DMA_INT_HTF)  && ((interrupt) != DMA_INT_FTF) && \
                                                              ((interrupt) != DMA_INT_FEE) && ((interrupt) != DMA_INT_TIMEOUT) && \
                                                              ((interrupt) != DMA_INT_TMR))
/* check DMAMUX multiplexer channel */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMAMUX_CHANNEL_HIGH                                  DMAMUX_MUXCH31
#else
#define DMAMUX_CHANNEL_HIGH                                  DMAMUX_MUXCH15
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define NOT_DMAMUX_MULTIPLEXER_CHANNEL(channels)             ((uint32_t)DMAMUX_CHANNEL_HIGH < ((uint32_t)channels))
/* check DMAMUX generator channel */
#define DMAMUX_GENERATOR_CHANNEL_HIGH                        DMAMUX_GENCH7
#define NOT_DMAMUX_GENERATOR_CHANNEL(channels)               ((uint32_t)DMAMUX_GENERATOR_CHANNEL_HIGH < ((uint32_t)channels))
/* check DMAMUX sync_id */
#define DMAMUX_SYNC_ID_HIGH                                  DMAMUX_SYNC_TIMER1_TRGO
#define NOT_DMAMUX_SYNC_ID(sync_id)                          (DMAMUX_SYNC_ID_HIGH < (sync_id))
/* check DMAMUX sync_polarity */
#define NOT_DMAMUX_SYNC_POLARITY(sync_polarity)              (((sync_polarity) != DMAMUX_SYNC_NO_EVENT)       && ((sync_polarity) != DMAMUX_SYNC_RISING) && \
                                                              ((sync_polarity) != DMAMUX_SYNC_FALLING)        && ((sync_polarity) != DMAMUX_SYNC_RISING_FALLING))
/* check DMAMUX request number */
#define DMAMUX_REQUEST_NUMBER_LOW                            (1U)
#define DMAMUX_REQUEST_NUMBER_HIGH                           (32U)
#define NOT_DMAMUX_REQUEST_NUMBER(request_number)            ((DMAMUX_REQUEST_NUMBER_HIGH < (request_number)) || (DMAMUX_REQUEST_NUMBER_LOW > (request_number)))

/* check DMAMUX trigger_id */
#define DMAMUX_TRIGGER_ID_HIGH                               DMAMUX_TRIGGER_TIMER1_TRGO
#define NOT_DMAMUX_TRIGGER_ID(trigger_id)                    (DMAMUX_TRIGGER_ID_HIGH < (trigger_id))
/* check DMAMUX trigger_polarity */
#define NOT_DMAMUX_TRIGGER_POLARITY(trigger_polarity)        (((trigger_polarity) != DMAMUX_GEN_NO_EVENT) && ((trigger_polarity) != DMAMUX_GEN_RISING) && \
                                                              ((trigger_polarity) != DMAMUX_GEN_FALLING) && ((trigger_polarity) != DMAMUX_GEN_RISING_FALLING))
/* check DMAMUX flag */
#define DMAMUX_FLAG_LOW0                                     DMAMUX_FLAG_MUXCH0_SO
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMAMUX_FLAG_HIGH0                                    DMAMUX_FLAG_MUXCH31_SO
#else
#define DMAMUX_FLAG_HIGH0                                    DMAMUX_FLAG_MUXCH15_SO
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define DMAMUX_FLAG_LOW1                                     DMAMUX_FLAG_GENCH0_TO
#define DMAMUX_FLAG_HIGH1                                    DMAMUX_FLAG_GENCH7_TO
#define NOT_DMAMUX_FLAG(flag)                                (((DMAMUX_FLAG_HIGH0 < (flag)) || (DMAMUX_FLAG_LOW0 > (flag))) && \
                                                              (((DMAMUX_FLAG_HIGH1 < (flag)) || (DMAMUX_FLAG_LOW1 > (flag)))))
/* check DMAMUX interrupt */
#define DMAMUX_INTERRUPT_LOW0                                DMAMUX_INT_MUXCH0_SO
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMAMUX_INTERRUPT_HIGH0                               DMAMUX_INT_MUXCH31_SO
#else
#define DMAMUX_INTERRUPT_HIGH0                               DMAMUX_INT_MUXCH15_SO
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define DMAMUX_INTERRUPT_LOW1                                DMAMUX_INT_GENCH0_TO
#define DMAMUX_INTERRUPT_HIGH1                               DMAMUX_INT_GENCH1_TO
#define NOT_DMAMUX_INTERRUPT(interrupt)                      (((DMAMUX_INTERRUPT_HIGH0 < (interrupt)) || (DMAMUX_INTERRUPT_LOW0 > (interrupt))) && \
                                                              (((DMAMUX_INTERRUPT_HIGH1 < (interrupt)) || (DMAMUX_INTERRUPT_LOW1 > (interrupt)))))
/* check DMAMUX interrupt flag */
#define DMAMUX_INTERRUPT_FLAG_LOW0                           DMAMUX_INT_FLAG_MUXCH0_SO
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define DMAMUX_INTERRUPT_FLAG_HIGH0                          DMAMUX_INT_FLAG_MUXCH31_SO
#else
#define DMAMUX_INTERRUPT_FLAG_HIGH0                          DMAMUX_INT_FLAG_MUXCH15_SO
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define DMAMUX_INTERRUPT_FLAG_LOW1                           DMAMUX_INT_FLAG_GENCH0_TO
#define DMAMUX_INTERRUPT_FLAG_HIGH1                          DMAMUX_INT_FLAG_GENCH7_TO
#define NOT_DMAMUX_INTERRUPT_FLAG(interrupt_flag)            (((DMAMUX_INTERRUPT_FLAG_HIGH0 < (interrupt_flag)) || (DMAMUX_INTERRUPT_FLAG_LOW0 > (interrupt_flag))) && \
                                                              (((DMAMUX_INTERRUPT_FLAG_HIGH1 < (interrupt_flag)) || (DMAMUX_INTERRUPT_FLAG_LOW1 > (interrupt_flag)))))
/* check DMA priority */
#define NOT_DMA_RR_PRIORITY(priority)                         (((priority) != DMA_RR_PRIORITY_LOW) && ((priority) != DMA_RR_PRIORITY_MEDIUM) && \
                                                               ((priority) != DMA_RR_PRIORITY_HIGH) && ((priority) != DMA_RR_PRIORITY_ULTRA_HIGH))
#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */
/* DMA deinitialization and initialization functions */
/* deinitialize DMA a channel registers */
void dma_deinit(uint32_t dma_periph, dma_channel_enum channelx);
/* initialize the DMA single data mode parameters struct with the default values */
void dma_single_data_para_struct_init(dma_single_data_parameter_struct *init_struct);
/* initialize the DMA multi data mode parameters struct with the default values */
void dma_multi_data_para_struct_init(dma_multi_data_parameter_struct *init_struct);
/* initialize DMA single data mode */
void dma_single_data_mode_init(uint32_t dma_periph, dma_channel_enum channelx, dma_single_data_parameter_struct *init_struct);
/* initialize DMA multi data mode */
void dma_multi_data_mode_init(uint32_t dma_periph, dma_channel_enum channelx, dma_multi_data_parameter_struct *init_struct);

/* DMA configuration functions */
/* set DMA peripheral base address */
void dma_periph_address_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t address);
/* set DMA memory base address */
void dma_memory_address_config(uint32_t dma_periph, dma_channel_enum channelx, uint8_t memory_flag, uint32_t address);

/* set the number of remaining data to be transferred by the DMA */
void dma_transfer_number_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t number);
/* get the number of remaining data to be transferred by the DMA */
uint32_t dma_transfer_number_get(uint32_t dma_periph, dma_channel_enum channelx);

