sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dma.h
/* configure priority level of DMA channel */
void dma_priority_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t priority);

/* configure transfer burst beats of memory */
void dma_memory_burst_beats_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t mbeat);
/* configure transfer burst beats of peripheral */
void dma_periph_burst_beats_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t pbeat);
/* configure transfer data size of memory */
void dma_memory_width_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t msize);
/* configure transfer data size of peripheral */
void dma_periph_width_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t psize);

/* configure memory address generation generation_algorithm */
void dma_memory_address_generation_config(uint32_t dma_periph, dma_channel_enum channelx, uint8_t generation_algorithm);
/* configure peripheral address generation_algorithm */
void dma_peripheral_address_generation_config(uint32_t dma_periph, dma_channel_enum channelx, uint8_t generation_algorithm);

/* enable DMA circulation mode */
void dma_circulation_enable(uint32_t dma_periph, dma_channel_enum channelx);
/* disable DMA circulation mode */
void dma_circulation_disable(uint32_t dma_periph, dma_channel_enum channelx);
/* enable DMA channel */
void dma_channel_enable(uint32_t dma_periph, dma_channel_enum channelx);
/* disable DMA channel */
void dma_channel_disable(uint32_t dma_periph, dma_channel_enum channelx);

/* configure the direction of data transfer on the channel */
void dma_transfer_direction_config(uint32_t dma_periph, dma_channel_enum channelx, uint8_t direction);

/* DMA switch buffer mode configure */
void dma_switch_buffer_mode_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t memory1_addr, uint32_t memory_select);
/* DMA using memory get */
uint32_t dma_using_memory_get(uint32_t dma_periph, dma_channel_enum channelx);

/* enable dma channel peripheral address circulation function */
void dma_peripheral_address_circulation_enable(uint32_t dma_periph, dma_channel_enum channelx);
/* disable dma channel peripheral address circulation function */
void dma_peripheral_address_circulation_disable(uint32_t dma_periph, dma_channel_enum channelx);
/* enable dma channel memory address circulation function */
void dma_memory_address_circulation_enable(uint32_t dma_periph, dma_channel_enum channelx);
/* disable dma channel memory address circulation function */
void dma_memory_address_circulation_disable(uint32_t dma_periph, dma_channel_enum channelx);
/* enable dma channel circulation count function */
void dma_circulation_count_enable(uint32_t dma_periph, dma_channel_enum channelx);
/* disable dma channel circulation count function */
void dma_circulation_count_disable(uint32_t dma_periph, dma_channel_enum channelx);
/* configure dma channel circulation count */
void dma_circulation_count_config(uint32_t dma_periph, dma_channel_enum channelx, uint8_t count);
/* enable dma priority round robin function */
void dma_round_robin_mode_enable(uint32_t dma_periph, uint32_t priority);
/* disable dma priority round robin function */
void dma_round_robin_mode_disable(uint32_t dma_periph, uint32_t priority);

/* DMA flow controller configure */
void dma_flow_controller_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t controller);
/* enable DMA switch buffer mode */
void dma_switch_buffer_mode_enable(uint32_t dma_periph, dma_channel_enum channelx);
/* disable DMA switch buffer mode */
void dma_switch_buffer_mode_disable(uint32_t dma_periph, dma_channel_enum channelx);
/* DMA FIFO status get */
uint32_t dma_fifo_status_get(uint32_t dma_periph, dma_channel_enum channelx);

/* get DMA channel peripheral port CRC value */
uint32_t dma_peripheral_port_crc_value_get(uint32_t dma_periph, dma_channel_enum channelx);
/* set DMA channel peripheral port CRC value */
void dma_peripheral_port_crc_value_set(uint32_t dma_periph, dma_channel_enum channelx, uint32_t data);
/* set DMA peripheral port initial CRC data */
void dma_peripheral_port_initial_crc_value_set(uint32_t dma_periph, uint32_t data);
/* get DMA peripheral port initial CRC value */
uint32_t dma_peripheral_port_initial_crc_value_get(uint32_t dma_periph);
/* deinit DMA channel peripheral port CRC value */
void dma_peripheral_port_crc_value_deinit(uint32_t dma_periph, dma_channel_enum channelx);
/* get DMA channel peripheral port current transferred address */
uint32_t dma_peripheral_port_current_address_get(uint32_t dma_periph, dma_channel_enum channelx);
/* get DMA channel memory port current transferred address */
uint32_t dma_memory_port_current_address_get(uint32_t dma_periph, dma_channel_enum channelx);

/* enable DMA channel transfer timeout monitor */
void dma_transfer_timeout_monitor_enable(uint32_t dma_periph, dma_channel_enum channelx);
/* disable DMA channel transfer timeout monitor */
void dma_transfer_timeout_monitor_disable(uint32_t dma_periph, dma_channel_enum channelx);
/* set DMA channel transfer timeout threshold value */
void dma_transfer_timeout_threshold_value_set(uint32_t dma_periph, dma_channel_enum channelx, uint32_t threshold_value);
/* get DMA channel transfer timeout threshold value */
uint32_t dma_transfer_timeout_threshold_value_get(uint32_t dma_periph, dma_channel_enum channelx);

/* flag and interrupt functions */
/* get DMA flag is set or not */
FlagStatus dma_flag_get(uint32_t dma_periph, dma_channel_enum channelx, uint32_t flag);
/* clear DMA a channel flag */
void dma_flag_clear(uint32_t dma_periph, dma_channel_enum channelx, uint32_t flag);
/* get DMA interrupt flag is set or not */
FlagStatus dma_interrupt_flag_get(uint32_t dma_periph, dma_channel_enum channelx, uint32_t interrupt);
/* clear DMA a channel interrupt flag */
void dma_interrupt_flag_clear(uint32_t dma_periph, dma_channel_enum channelx, uint32_t interrupt);
/* enable DMA interrupt */
void dma_interrupt_enable(uint32_t dma_periph, dma_channel_enum channelx, uint32_t interrupt);
/* disable DMA interrupt */
void dma_interrupt_disable(uint32_t dma_periph, dma_channel_enum channelx, uint32_t interrupt);

/* DMAMUX functions */
/* DMAMUX request multiplexer functions */
/* initialize the parameters of DMAMUX synchronization mode structure with the default values */
void dmamux_sync_struct_para_init(dmamux_sync_parameter_struct *init_struct);
/* initialize DMAMUX request multiplexer channel synchronization mode */
void dmamux_synchronization_init(dmamux_multiplexer_channel_enum channelx, dmamux_sync_parameter_struct *init_struct);
/* enable synchronization mode */
void dmamux_synchronization_enable(dmamux_multiplexer_channel_enum channelx);
/* disable synchronization mode */
void dmamux_synchronization_disable(dmamux_multiplexer_channel_enum channelx);
/* enable event generation */
void dmamux_event_generation_enable(dmamux_multiplexer_channel_enum channelx);
/* disable event generation */
void dmamux_event_generation_disable(dmamux_multiplexer_channel_enum channelx);

